Audio/Video Transport WG                                      S. Wenger 
Internet Draft                                               Y.-K. Wang 
Intended status: Standards track                                  Nokia 
Expires: December 2008                                       T. Schierl 
                                                         Fraunhofer HHI 
                                                       A. Eleftheriadis 
                                                                  Vidyo 
                                                           June 3, 2008 
                                    
 
 
                                      
                     RTP Payload Format for SVC Video 
                       draft-ietf-avt-rtp-svc-10.txt 


    

Status of this Memo 

   By submitting this Internet-Draft, each author represents that any 
   applicable patent or other IPR claims of which he or she is aware 
   have been or will be disclosed, and any of which he or she becomes 
   aware will be disclosed, in accordance with Section 6 of BCP 79. 

   Internet-Drafts are working documents of the Internet Engineering 
   Task Force (IETF), its areas, and its working groups.  Note that 
   other groups may also distribute working documents as Internet-
   Drafts. 

   Internet-Drafts are draft documents valid for a maximum of six months 
   and may be updated, replaced, or obsoleted by other documents at any 
   time.  It is inappropriate to use Internet-Drafts as reference 
   material or to cite them other than as "work in progress." 

   The list of current Internet-Drafts can be accessed at 
   http://www.ietf.org/ietf/1id-abstracts.txt 

   The list of Internet-Draft Shadow Directories can be accessed at 
   http://www.ietf.org/shadow.html 

   This Internet-Draft will expire on December 3, 2008. 

Copyright Notice 

   Copyright (C) The IETF Trust (2008). 

 
 
 
 
Wenger, et al          Expires December 3, 2008                [Page 1] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

Abstract 

   This memo describes an RTP payload format for scalable video coding 
   (SVC) defined in_Annex G of the ITU-T Recommendation H.264 video 
   codec which is technically identical to Amendment 3 of ISO/IEC 
   International Standard 14496-10.  The RTP payload format allows for 
   packetization of one or more Network Abstraction Layer (NAL) units, 
   produced by the video encoder, in each RTP packet payload.  The 
   payload format has wide applicability, such as low bit-rate 
   conversational, Internet video streaming, or high bit-rate 
   entertainment quality video. 

    

Table of Contents 

    
   Status of this Memo...............................................1 
   Copyright Notice..................................................1 
   Abstract..........................................................2 
   Table of Contents.................................................2 
   1. Introduction...................................................4 
   2. Conventions....................................................4 
   3. The SVC Codec..................................................4 
      3.1. Overview..................................................4 
      3.2. Parameter Set Concept.....................................7 
      3.3. Network Abstraction Layer Unit Header.....................7 
   4. Scope.........................................................10 
   5. Definitions and Abbreviations.................................12 
      5.1. Definitions..............................................12 
         5.1.1. Definitions Per SVC Specification...................12 
         5.1.2. Definitions Local to This Memo......................14 
      5.2. Abbreviations............................................17 
   6. RTP Payload Format............................................17 
      6.1. Design Principles........................................17 
      6.2. RTP Header Usage.........................................17 
      6.3. Common Structure of the RTP Payload Format...............17 
      6.4. NAL Unit Header Usage....................................18 
      6.5. Packetization Modes......................................19 
         6.5.1. Packetization Modes for Session Multiplexing........19 
      6.6. Decoding Order Number (DON)..............................22 
         6.6.1. Cross-Session DON (CS-DON) for Session Multiplexing.22 
      6.7. Aggregation Packets......................................24 
      6.8. Fragmentation Units (FUs)................................24 
      6.9. Payload Content Scalability Information (PACSI) NAL Unit.24 
      6.10. Non-Interleaved Multi-Time Aggregation Packets (NI-MTAPs)31 
   7. Packetization Rules...........................................33 
 
 
Wenger, et al          Expires December 3, 2008                [Page 2] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      7.1. Packetization Rules for Session Multiplexing.............34 
         7.1.1. NI-T / NI-TC session-multiplexing packetization rules.34 
         7.1.2. NI-C / NI-TC session-multiplexing packetization mode 
         rules......................................................35 
         7.1.3. I-C session-multiplexing packetization mode rules...36 
         7.1.4. Packetization rules for non-VCL NAL units...........37 
         7.1.5. Packetization rules for Prefix NAL units............37 
   8. De-Packetization Process......................................37 
      8.1. De-Packetization Process for Session Multiplexing........38 
         8.1.1. Decoding Order Recovery for the NI-T and NI-TC Modes38 
            8.1.1.1. Informative Algorithm for NI-T Decoding Order 
            Recovery within an Access Unit..........................41 
         8.1.2. Decoding Order Recovery for the NI-C, NI-TC and I-C 
         Modes......................................................44 
   9. Payload Format Parameters.....................................46 
      9.1. Media Type Registration..................................47 
      9.2. SDP Parameters...........................................57 
         9.2.1. Mapping of Payload Type Parameters to SDP...........57 
         9.2.2. Usage with the SDP Offer/Answer Model...............58 
         9.2.3. Usage with Session Multiplexing.....................63 
         9.2.4. Usage in Declarative Session Descriptions...........63 
      9.3. Examples.................................................64 
         9.3.1. Example for Offering A Single SVC Session...........64 
         9.3.2. Example for Offering Session Multiplexing...........65 
      9.4. Parameter Set Considerations.............................65 
   10. Security Considerations......................................66 
   11. Congestion Control...........................................66 
   12. IANA Consideration...........................................67 
   13. Informative Appendix: Application Examples...................67 
      13.1. Introduction............................................67 
      13.2. Layered Multicast.......................................68 
      13.3. Streaming of an SVC Scalable Stream.....................68 
      13.4. Multicast to MANE, SVC Scalable Stream to Endpoint......69 
      13.5. Scenarios Currently Not Considered......................70 
      13.6. SSRC Multiplexing.......................................72 
   14. References...................................................72 
      14.1. Normative References....................................72 
      14.2. Informative References..................................73 
   15. Authors' Addresses...........................................74 
   Intellectual Property Statement..................................75 
   Disclaimer of Validity...........................................76 
   Copyright Statement..............................................76 
   Acknowledgement..................................................76 
   16. Open Issues..................................................76 
   17. Changes Log..................................................77 
   From draft-ietf-avt-rtp-svc-08 to draft-ietf-avt-rtp-svc-09......77 
   From draft-ietf-avt-rtp-svc-09 to draft-ietf-avt-rtp-svc-10......79 
 
 
Wenger, et al          Expires December 3, 2008                [Page 3] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

    
    

1. Introduction 

   This memo specifies an RTP [RFC3550] payload format for the Scalable 
   Video Coding (SVC) extension of the H.264/AVC video coding standard.  
   Formally, SVC takes the form of Amendment 3 to ISO/IEC 14496 Part 10 
   [MPEG4-10], and Annex G of ITU-T Rec. H.264/AVC [H.264]. The 
   specification of SVC is available in [SVC]. 

   SVC covers the whole application ranges of H.264/AVC, starting with 
   low bit-rate Internet streaming applications to HDTV broadcast and 
   Digital Cinema with nearly lossless coding and requiring dozens or 
   hundreds of MBit/s. 

   This memo defines a backwards compatible enhancement to the H264/AVC 
   payload format [RFC3984], in which the specific features introduced 
   by SVC are taken into account. [Edt. Note (AE): Review backwards 
   compatibility assertion, and qualify, when memo is completed.]  
   Specifically, it documents the enhancements relevant from an RTP 
   transport viewpoint, and defines signaling support for SVC, including 
   a new media subtype name. 

2. Conventions 

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", 
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this 
   document are to be interpreted as described in BCP 14, RFC 2119 
   [RFC2119]. 

   This specification uses the notion of setting and clearing a bit when 
   bit fields are handled.  Setting a bit is the same as assigning that 
   bit the value of 1 (On).  Clearing a bit is the same as assigning 
   that bit the value of 0 (Off). 

3. The SVC Codec 

3.1. Overview 

   SVC defines a coded video representation in which a given bitstream 
   offers representations of the source material at different levels of 
   fidelity (hence the term "scalable").  Scalable video coding 
   bitstreams, or scalable bitstreams, are constructed in a pyramidal 
   fashion: the coding process creates bitstream components that improve 
   the fidelity of hierarchically lower components. 

 
 
Wenger, et al          Expires December 3, 2008                [Page 4] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   The fidelity dimensions offered by SVC are spatial (picture size), 
   quality (or Signal-to-Noise Ratio - SNR), as well as temporal 
   (pictures per second).  Bitstream components associated with a given 
   level of spatial, quality, and temporal fidelity are identified using 
   corresponding parameters in the bitstream: dependency_id, quality_id, 
   and temporal_id (see also Section 3.3).  The fidelity identifiers 
   have integer values, where higher values designate components that 
   are higher in the hierarchy.  It is noted that SVC offers significant 
   flexibility in terms of how an encoder may choose to structure the 
   dependencies between the various components.  Decoding of a 
   particular component requires the availability of all the components 
   it depends upon, either directly, or indirectly.  An operation point 
   of an SVC bitstream consists of the bistream components required to 
   be able to decode a particular dependency_id, quality_id, and 
   temporal_id combination. 

   SVC maintains the bitstream organization introduced in H.264/AVC.  
   Specifically, all bitstream components are encapsulated in Network 
   Abstraction Layer (NAL) units which are organized as Access Units 
   (AU).  An AU is associated with a single sampling instance in time.  
   A subset of the NAL unit types correspond to the Video Coding Layer 
   (VCL), and contain the coded picture data associated with the source 
   content.  Coded picture data at the various fidelity dimensions are 
   organized in slices.  Within one AU, a coded picture of an operation 
   point consists of all the coded slices required for decoding up to 
   the particular combination of dependency_id and quality_id values  at 
   the time instance corresponding to the AU.  The NAL encapsulates each 
   slice generated by the VCL into one or more NAL units.  Please 
   consult RFC 3984 for a more in-depth discussion of the NAL unit 
   concept.  SVC specifies the decoding order of NAL units. 

   It is noted that the concept of temporal scalability is already 
   present in H.264/AVC as profiles defined in Annex A of [H.264] 
   already support it.  Specifically, in [H.264] sub-sequences have been 
   introduced in order to allow optional use of temporal layers.  SVC 
   extends this approach by exposing the temporal scalability 
   information using the temporal_id parameter, alongside the 
   dependency_id and quality_id values that are used for spatial and 
   quality scalability.  For coded picture data defined in Annex G of 
   [SVC] this is accomplished by using a new type of NAL unit where the 
   fidelity parameters are part of its header.  For coded picture data 
   that follow H.264/AVC, and to ensure compatibility with existing 
   H.264/AVC receivers, a new type of "prefix" NAL unit has been defined 
   to carry this header information.  This prefix NAL unit type is among 
   those ignored by H.264/AVC receivers as explained in [RFC3984].  


 
 
Wenger, et al          Expires December 3, 2008                [Page 5] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   Within an AU, the VCL NAL units associated with a given dependency_id 
   and quality_id are referred to as a "layer representation".  The 
   layer representation corresponding to the lowest values of 
   dependency_id and quality_id (i.e., zero) is the base layer 
   representation and is compliant by design to H.264/AVC.  The set of 
   VCL and associated non-VCL NAL units across all AUs in a bitstream 
   associated with a particular combination of values of dependency_id 
   and quality_id, and regardless of the value of temporal_id, is 
   conceptually a scalable layer.  Due to the backwards compatibility 
   with H.264/AVC, it is important to differentiate however whether or 
   not SVC-specific NAL units are present in a given bitstream or not.  
   This is particularly important for the lowest fidelity values in 
   terms of dependency_id and quality_id (zero for both), as the 
   corresponding VCL data are compliant to H.264/AVC, and may or may not 
   be accompanied by associated prefix NAL units.  This memo therefore 
   uses the term "AVC base layer" to designate the layer that contains 
   only H.264/AVC VCL NAL units, and "SVC base layer" to designate the 
   same layer but with the addition of the associated SVC prefix NAL 
   units.  Note that the SVC specification [SVC] uses the term "base 
   layer" for what in this memo will be referred to as "AVC base layer".  
   Similarly, it is also important to be able to differentiate, within a 
   layer, the temporal fidelity components it contains.  This memo uses 
   the term "T0" to indicate, within a particular layer, the subset that 
   contains the NAL units associated with temporal_id equal to 0. 

   The term "layer" is used in various contexts in this memo.  For 
   example, in the terms "Video Coding Layer" and "Network Abstraction 
   Layer" it refers to conceptual organization levels.  When referring 
   to bitstream syntax elements such as block layer or macroblock layer, 
   it refers to hierarchical bitstream structure levels.  When used in 
   the context of bitstream scalability, e.g., "AVC base layer", it 
   refers to a level of representation fidelity of the source signal 
   with a specific set of NAL units included.  The correct 
   interpretation is supported by providing the appropriate context. 

   SNR scalability in SVC is offered in two different ways.  In what is 
   called Coarse-Grained Scalability (CGS), scalability is provided by 
   including or excluding a complete layer when decoding a particular 
   bitstream.  In contrast, in Medium-Grained Scalability (MGS), 
   scalability is provided by selectively omitting the decoding of 
   specific NAL units belonging to MGS layers.  The selection of the NAL 
   units to omit can be based on fixed length fields in the NAL unit 
   header. 




 
 
Wenger, et al          Expires December 3, 2008                [Page 6] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

3.2. Parameter Set Concept 

   The parameter set concept is inherited from [H.264].  Please refer to 
   section 1.2 of RFC 3984 for more details. 

   SVC introduced a new type of sequence parameter set, referred to as a 
   subset sequence parameter set.  Subset sequence parameter sets have 
   NAL unit type equal to 15, which is different from the NAL unit type 
   value (7) of sequence parameter set.  VCL NAL units of NAL unit type 
   1 to 5 must only (indirectly) refer to sequence parameter sets, while 
   VCL NAL units of NAL unit type 20 must only (indirectly) refer to 
   subset sequence parameter sets.  Subset sequence parameter sets use a 
   separate identifier value space than sequence parameter sets. 

   In SVC, coded picture data from different layers may use the same or 
   different sequence and picture parameter sets.  At any time instant 
   during the decoding process there may be one active sequence 
   parameter set (for the layer representation with the highest value of 
   (dependency_id * 16 + quality_id)) and one or more active layer SVC 
   sequence parameter set(s) (for layer representations with lower 
   values of (dependency_id * 16 + quality_id)).  The active sequence 
   parameter set or an active layer SVC sequence parameter set remains 
   unchanged throughout a coded video sequence in the scalable layer in 
   which the active sequence parameter set or active layer SVC sequence 
   parameter set is referred to.  This means that the referred sequence 
   parameter set or subset sequence parameter set can only change at IDR 
   access units for any layer.  At any time instant during the decoding 
   process there may be one active picture parameter set (for the layer 
   representation with the highest value of (dependency_id * 16 + 
   quality_id)) and one or more active layer picture parameter set(s) 
   (for layer representations with lower values of (dependency_id * 16 + 
   quality_id)).  The active picture parameter set or an active layer 
   picture parameter set remains unchanged throughout a layer 
   representation in which the active picture parameter set or active 
   layer picture parameter set is referred to, but may change from one 
   AU to the next. 

3.3. Network Abstraction Layer Unit Header 

   SVC NAL units of type 20 encapsulate VCL data as defined in Annex G 
   of [SVC].  A special type of an SVC NAL unit is the prefix NAL unit 
   (type 14) that includes descriptive information of the associated 
   H.264/AVC VCL NAL unit (type 1 or 5) that immediately follows the 
   prefix NAL unit.   

   SVC extends the one-byte H.264/AVC NAL unit header by three 
   additional octets.  The header indicates the type of the NAL unit, 
 
 
Wenger, et al          Expires December 3, 2008                [Page 7] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   the (potential) presence of bit errors or syntax violations in the 
   NAL unit payload, information regarding the relative importance of 
   the NAL unit for the decoding process, the layer identification 
   information, and other fields as discussed below. 

   The syntax and semantics of the NAL unit header are formally 
   specified in [SVC], but the essential properties of the NAL unit 
   header are summarized below. 

   The first byte of the NAL unit header has the following format (the 
   bit fields are the same as defined for the one-byte H.264/AVC NAL 
   unit header, while the semantics of some fields have changed 
   slightly, in a backward compatible way): 

         +---------------+ 
         |0|1|2|3|4|5|6|7| 
         +-+-+-+-+-+-+-+-+ 
         |F|NRI|  Type   | 
         +---------------+ 
    
   The semantics of the components of the NAL unit type octet, as 
   specified in the H.264 specification, are described briefly below. 

   F: 1 bit 
      forbidden_zero_bit.  H.264/AVC declares a value of 1 as a syntax 
      violation. 

   NRI: 2 bits 
      nal_ref_idc.  A value of '00' (in binary form) indicates that the 
      content of the NAL unit is not used to reconstruct reference 
      pictures for future prediction.  Such NAL units can be discarded 
      without risking the integrity of the reference pictures in the 
      same Layer.  A value greater than '00' indicates that the 
      decoding of the NAL unit is required to maintain the integrity of 
      reference pictures in the same Layer, or that the NAL unit 
      contains parameter sets. 

   Type: 5 bits 
      nal_unit_type.  This component specifies the NAL unit type as 
      defined in table 7-1 of [SVC], and later within this memo.  For a 
      reference of all currently defined NAL unit types and their 
      semantics, please refer to section 7.4.1 in [SVC]. 

      In H.264/AVC, NAL unit types 14, 15 and 20 are reserved for 
      future extensions.  SVC uses these three NAL unit types.  NAL 
      unit type 14 is used for prefix NAL unit, NAL unit type 15 is 
      used for subset sequence parameter set and NAL unit type 20 is 
 
 
Wenger, et al          Expires December 3, 2008                [Page 8] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      used for coded slice in scalable extension (see section 7.4.1 in 
      [SVC]).  NAL unit types 14 and 20 indicate the presence of three 
      additional octets in the NAL unit header, as shown below. 

            +---------------+---------------+---------------+ 
            |0|1|2|3|4|5|6|7|0|1|2|3|4|5|6|7|0|1|2|3|4|5|6|7| 
            +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
            |R|I|   PRID    |N| DID |  QID  | TID |U|D|O| RR| 
            +---------------+---------------+---------------+ 
    
   R: 1 bit 
      reserved_one_bit.  Reserved bit for future extension.  R MUST be 
      equal to 1.  Receivers SHOULD ignore the value of R. 

   I: 1 bit 
      idr_flag.  This component specifies whether the layer 
      representation is an instantaneous decoding refresh (IDR) layer 
      representation (when equal to 1) or not (when equal to 0). 

   PRID: 6 bits 
      priority_id.  This flag specifies a priority identifier for the 
      NAL unit.  A lower value of PRID indicates a higher priority. 

   N: 1 bit 
      no_inter_layer_pred_flag.  This flag specifies, when present in a 
      coded slice NAL unit, whether inter-layer prediction may be used 
      for decoding the coded slice (when equal to 1) or not (when equal 
      to 0). 

   DID: 3 bits 
      dependency_id.  This component indicates the inter-layer coding 
      dependency level of a layer representation.  At any access unit, 
      a layer representation with a given dependency_id may be used for 
      inter-layer prediction for coding of a layer representation with 
      a higher dependency_id, while a layer representation with a given 
      dependency_id shall not be used for inter-layer prediction for 
      coding of a layer representation with a lower dependency_id. 

   QID: 4 bits 
      quality_id.  This component indicates the quality level of an MGS 
      layer representation.  At any access unit and for identical 
      dependency_id values, a layer representation with quality_id 
      equal to ql uses a layer representation with quality_id equal to 
      ql-1 for inter-layer prediction. 

   TID: 3 bits 
      temporal_id.  This component indicates the temporal level of a 
 
 
Wenger, et al          Expires December 3, 2008                [Page 9] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      layer representation.  The temporal_id is associated with the 
      frame rate, with lower values of _temporal_id corresponding to 
      lower frame rates.  A layer representation at a given temporal_id 
      typically depends on layer representations with lower temporal_id 
      values, but it never depends on layer representations with higher 
      temporal_id values. 

   U: 1 bit 
      use_ref_base_pic_flag.  A value of 1 indicates that only 
      reference base pictures are used during the inter prediction 
      process.  A value of 0 indicates that the reference base pictures 
      are not used during the inter prediction process. 

   D: 1 bit 
      discardable_flag.  A value of 1 indicates that the current NAL 
      unit is not used for decoding NAL units with values of 
      dependency_id higher than the one of the current NAL unit, in the 
      current and all subsequent access units.  Such NAL units can be 
      discarded without risking the integrity of layers with higher 
      dependency_id values.  discardable_flag equal to 0 indicates that 
      the decoding of the NAL unit is required to maintain the 
      integrity of layers with higher dependency_id. 

   O: 1 bit 
      output_flag: Affects the decoded picture output process as 
      defined in Annex C of [SVC]. 

   RR: 2 bits 
      reserved_three_2bits.  Reserved bits for future extension.  RR 
      MUST be equal to '11' (in binary form).  Receivers SHOULD ignore 
      the value of RR. 

   This memo reuses the same additional NAL unit types introduced in RFC 
   3984, which are presented in section 6.3.   In addition, this memo 
   introduces one OPTIONAL NAL unit type, 30, as specified in section 
   6.9. . These NAL unit types are marked as unspecified in [SVC] and 
   intentionally reserved for use in systems specifications like this 
   memo.  Moreover, this specification extends the semantics of F, NRI, 
   I, PRID, DID, QID, TID, U, and D as described in section 6.4.  

4. Scope 

   This payload specification can only be used to carry the "naked" NAL 
   unit stream over RTP, and not the byte stream format according to 
   Annex B of [SVC].  The likely applications of this specification will 
   be in the IP based multimedia communications fields including 

 
 
Wenger, et al          Expires December 3, 2008               [Page 10] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   conversational multimedia, video telephony or video conferencing, 
   Internet streaming and TV over IP. 

   This specification allows, in a given RTP stream, to encapsulate NAL 
   units belonging to 

   o  the T0 AVC base layer or the T0 SVC base layer only, as detailed 
      in [RFC3984], or 

   o  one or more enhancement layers, or 

   o  the T0 SVC base layer, and one or more enhancement layers 

   Session multiplexing SHOULD be used when different receivers in the 
   multicast session may request different operation points of the 
   scalable bitstream.  In session multiplexing, layers are carried in 
   multiple RTP sessions, and each RTP session is associated with one 
   RTP stream.  The RTP stream in each RTP session MAY carry one or more 
   layers, which can be any of the above three.  When each operation 
   point corresponding to a layer may be required by some receivers, 
   then each Layer SHOULD be carried in its own RTP stream and its own 
   RTP session.  When fewer operation points are required by the 
   receivers, then multiple layers MAY be encapsulated within one RTP 
   stream in one RTP session. 

         Informative note: Layered multicast is a term commonly used to 
         describe the application where multicast is used to transmit 
         data that has been encapsulated into more than one RTP session 
         using session multiplexing.  This application allows different 
         receivers in the multicast session to receive different 
         operation points of the scalable bitstream.  Layered 
         multicast, among other application examples, is discussed in 
         more detail in the informative Section 13.2. . 

   When session multiplexing is not used, the following applies. 

   o  When an H.264/AVC compatible subset of the SVC base layer is 
      transmitted, the subset SHOULD be carried in one RTP stream that 
      MUST be encapsulated according to RFC 3984.  This way, a legacy 
      RFC 3984 receiver will be able to receive the H.264/AVC compatible 
      bitstream subset. 

   o  When a set of layers including one or more SVC enhancement layers 
      is transmitted, the set SHOULD be carried in one RTP stream that 
      SHOULD be encapsulated according to this memo. 


 
 
Wenger, et al          Expires December 3, 2008               [Page 11] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   This RTP payload specification is designed to be unaware of the octet 
   string in the NAL unit payload defined in [SVC].  The NAL unit header 
   defined in [SVC] co-serves as the payload header of this RTP payload 
   format, when single NAL unit packetization is used, i.e. one NAL unit 
   per RTP packet.  In this case, the payload of a NAL unit follows 
   immediately.  Additionally to [RFC3984], this memo locally defines a 
   NAL unit type in the unspecified NAL unit type space of [SVC].  If 
   other than the single NAL unit packetization mode is used as defined 
   in [RFC3984] or this memo, locally defined NAL unit types may be 
   additionally present in the RTP packets, together with one or more 
   NAL unit types as specified in [SVC]. 

5. Definitions and Abbreviations 

5.1. Definitions 

5.1.1. Definitions Per SVC Specification 

   This document uses the definitions of [SVC].  The following terms, 
   defined in [SVC], are summed up for convenience: 

      access unit: A set of NAL units always containing exactly one 
      primary coded picture.  In addition to the primary coded picture, 
      an access unit may also contain one or more redundant coded 
      pictures, one auxiliary coded picture, or other NAL units not 
      containing slices or slice data partitions of a coded picture.  
      The decoding of an access unit always results in a decoded 
      picture. 

      base layer: A bitstream subset that contains all the NAL units 
      with the nal_unit_type syntax element equal to 1 and 5 of the 
      bitstream and does not contain any NAL unit with the 
      nal_unit_type syntax element equal to 14, 15, or 20 and conforms 
      to one or more of the profiles specified in Annex A of [H.264]. 

      base quality layer representation: The layer representation of 
      the target dependency representation of an access unit that is 
      associated with the quality_id syntax element equal to 0. 

      coded video sequence: A sequence of access units that consists, 
      in decoding order, of an IDR access unit followed by zero or more 
      non-IDR access units including all subsequent access units up to 
      but not including any subsequent IDR access unit. 

      dependency representation: A subset of VCL NAL units within an 
      access unit that are associated with the same value of the 
      dependency_id syntax element, which is provided as part of the 
 
 
Wenger, et al          Expires December 3, 2008               [Page 12] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      NAL unit header or by an associated prefix NAL unit.  A 
      dependency representation consist of one or more layer 
      representations. 

      IDR access unit: An access unit in which the primary coded 
      picture is an IDR picture. 

      IDR picture: A coded picture in which all slices of the target 
      dependency representation within the access unit are I or EI 
      slices that causes the decoding process to mark all reference 
      pictures as "unused for reference" immediately after decoding the 
      IDR picture.  After the decoding of an IDR picture all following 
      coded pictures in decoding order can be decoded without inter 
      prediction from any picture decoded prior to the IDR picture.  
      The first picture of each coded video sequence is an IDR picture. 

      layer representation: A subset of VCL NAL units within an access 
      unit that are associated with the same values of the 
      dependency_id and quality_id syntax elements, which are provided 
      as part of the VCL NAL unit header or by an associated prefix NAL 
      unit.  One or more layer representations represent a dependency 
      representation.  

      prefix NAL unit: A NAL unit with nal_unit_type equal to 14 that 
      immediately precedes in decoding order a NAL unit with 
      nal_unit_type equal to 1, 5, or 12.  The NAL unit that 
      immediately succeeds in decoding order the prefix NAL unit is 
      referred to as the associated NAL unit.  The prefix NAL unit 
      contains data associated with the associated NAL unit, which are 
      considered to be part of the associated NAL unit. 

      reference base picture: A reference picture that is obtained by 
      decoding a base quality layer representation with the nal_ref_idc 
      syntax element not equal to 0 and the store_ref_base_pic_flag 
      syntax element equal to 1 of an access unit and all layer 
      representations of the access unit that are referred to by inter-
      layer prediction of the base quality layer representation.  A 
      reference base picture is not an output of the decoding process, 
      but the samples of a reference base picture may be used for inter 
      prediction in the decoding process of subsequent pictures in 
      decoding order.  Reference base picture is a collective term for 
      a reference base field or a reference base frame. 

      scalable bitstream: A bitstream with the property that one or 
      more bitstream subsets that are not identical to the scalable 
      bitstream form another bitstream that conforms to the SVC 
      specification[SVC]. 
 
 
Wenger, et al          Expires December 3, 2008               [Page 13] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      target dependency representation: The dependency representation 
      of an access unit that is associated with the largest value of 
      the dependency_id syntax element for all dependency 
      representations of the access unit. 

      target layer representation: The layer representation of the 
      target dependency representation of an access unit that is 
      associated with the largest value of the quality_id syntax 
      element for all layer representations of the target dependency 
      representation of the access unit. 

5.1.2. Definitions Local to This Memo 

      anchor layer representation: An anchor layer representation is 
      such a layer representation that, if decoding of the operation 
      point corresponding to the layer starts from the access unit 
      containing this layer representation, all the following layer 
      representations of the layer, in output order, can be correctly 
      decoded.  An anchor layer representation is a random access point 
      to the layer the anchor layer representation belongs to.  
      However, some layer representations, succeeding an anchor layer 
      representation in decoding order but preceding the anchor layer 
      representation in output order, may refer to earlier layer 
      representations for inter prediction, and hence may not be 
      correctly decoded if random access is performed at the anchor 
      layer representation. 

      AVC base layer: The subset of the SVC base layer in which all 
      prefix NAL units (type 14) are removed. Note that this is 
      equivalent to the term "base layer" as defined in Annex G of 
      [SVC]. 

      base RTP session: The RTP session, among all the RTP sessions 
      using session multiplexing, that carries the RTP stream 
      containing the T0 AVC base layer or the T0 SVC base layer, and 
      zero or more enhancement layers.  This RTP session does not 
      depend on any other RTP session as indicated by mechanisms 
      defined in [I-D.ietf-mmusic-decoding-dependency].  The base RTP 
      session may carry NAL units of NAL unit type equal to 14 and 15. 

      enhancement RTP session: An RTP session, among all the RTP 
      sessions using session multiplexing, that is not the base RTP 
      session.  An enhancement RTP session typically contains an RTP 
      stream that depends on at least one other RTP session as 
      indicated by mechanisms defined in [I-D.ietf-mmusic-decoding-
      dependency].  A lower RTP session to an enhancement RTP session 
      is an RTP session which the enhancement RTP session depends on. 
 
 
Wenger, et al          Expires December 3, 2008               [Page 14] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      The lowest RTP session for a receiver is the RTP session that 
      does not depend on any other RTP session received by the 
      receiver.  The highest RTP session for a receiver is the RTP 
      session which no other RTP session received by the receiver 
      depends on. 

      cross-session decoding order number (CS-DON): A derived variable 
      indicating NAL unit decoding order number over all NAL units 
      within all the session-multiplexed RTP sessions that carry the 
      same SVC bitstream. 

      enhancement layer: A layer in which at least one of the values of 
      dependency_id or quality_id is higher than 0, or a layer in which 
      none of the NAL units is associated with the value of temporal_id 
      equal to 0.  An operation point constructed using the maximum 
      temporal_id, dependency_id, and quality_id values associated with 
      an enhancement layer may or may not conform to one or more of the 
      profiles specified in Annex A of [H.264]. 

      H.264/AVC compatible: A biststream subset that conforms to one or 
      more of the profiles specified in Annex A of [H.264]. 

      intra layer representation:  A layer representation that contains 
      only slices that use intra prediction, and hence do not refer to 
      any earlier layer representation in decoding order in the same 
      layer.  Note that in [SVC] intra prediction includes intra-layer 
      intra prediction as well as inter-layer intra prediction. 

      layer: A bistream subset in which all NAL units of type 1, 5, 12, 
      14, or 20 have the same values of dependency_id and quality_id, 
      either directly through their NAL unit header (for NAL units of 
      type 14 or 20) or through association to a prefix (type 14) NAL 
      unit (for NAL unit types 1, 5, or 12).  A layer may contain NAL 
      units associated with more than one values of temporal_id. 

      operation point: An operation point is identified by a set of 
      values of temporal_id, dependency_id, and quality_id. A bistream 
      corresponding to an operation point can be constructed by 
      removing all NAL units associated with a higher value of 
      dependency_id, and all NAL units associated with the same value 
      of dependency_id but higher values of quality_id or temporal_id. 
      Additional NAL units may be removed (with lower dependency_id or 
      same dependency_id but lower quality_id) if they are not required 
      for decoding the bitstream at the particular operation point. An 
      operation point bitstream conforms to at least one of the 
      profiles defined in Annex A or Annex G of [SVC], and offers a 
      representation of the original video signal at a certain 
 
 
Wenger, et al          Expires December 3, 2008               [Page 15] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      fidelity. [Ed.Note(YkW): Need to check whether a bitstream subset 
      with those additional NAL units removed is a conforming 
      bitstream.] 

      operation point representation: The set of all NAL units of an 
      operation point within the same access unit. 

      RTP packet stream: A sequence of RTP packets with increasing 
      sequence numbers (except for wrap-around), identical PT and 
      identical SSRC (Synchronization Source), carried in one RTP 
      session.  Within the scope of this memo, one RTP packet stream is 
      utilized to transport one or more layers. 

      session multiplexing: The SVC bitstream is distributed onto 
      different RTP sessions, whereby each RTP session carries a single 
      RTP packet stream.  Each RTP session requires a separate 
      signaling and has a separate Timestamp, Sequence Number, and SSRC 
      space.  Timestamps for the RTP sessions SHALL be derived from the 
      same clock instance.  Dependency between sessions MUST be 
      signaled according to [I-D.ietf-mmusic-decoding-dependency] and 
      this memo. 

      SVC base layer: The layer that includes all NAL units associated 
      with dependency_id and quality_id values both equal to 0, 
      including prefix NAL units (NAL unit type 14). 

      SVC enhancement layer: A layer in which at least one of the 
      values of dependency_id or quality_id is higher than 0.  An 
      operation point constructed using the maximum dependency_id and 
      quality_id values and any temporal_id value associated with an 
      SVC enhancement layer does not conform to any of the profiles 
      specified in Annex A of [H.264]. 

      SVC NAL unit: A NAL unit of NAL unit type 14, 15, or 20 as 
      specified in Annex G of [SVC]. 

      SVC NAL unit header: A four-byte header resulting from the 
      addition of a three-byte SVC-specific header extension added in 
      NAL unit types 14, 15 and 20. 

      SVC RTP session: Either the base RTP session or an enhancement 
      RTP session.   

      T0 AVC base layer: A subset of the AVC base layer constructed by 
      removing all VCL NAL units associated with temporal_id values 
      higher than 0. 

 
 
Wenger, et al          Expires December 3, 2008               [Page 16] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      T0 SVC base layer: A subset of the SVC base layer constructed by 
      removing all VCL NAL units associated with temporal_id values 
      higher than 0 as well as their associated prefix NAL units. 

5.2. Abbreviations 

   In addition to the abbreviations defined in [RFC3984], the following 
   ones are defined. 

      CGS:        Coarse-Grain Scalability 
      CS-DON:     Cross-Session Decoding Order Number 
      MGS:        Medium-Grain Scalability 
      PACSI:      Payload Content Scalability Information 
      SVC:        Scalable Video Coding 

6. RTP Payload Format 

6.1. Design Principles 

   The following design principles have been observed: 

   o  Backward compatibility with [RFC3984] wherever possible. 

   o  The SVC base layer or any H.264/AVC compatible subset of the SVC 
      base layer, when transmitted in its own RTP stream, MUST be  
        encapsulated using [RFC3984].  This ensures that such an RTP 
      stream can be understood by RFC 3984 legacy receivers. 

   o  MANEs are signaling aware and rely on signaling information.  
      MANEs have state. 

   o  MANEs can aggregate multiple RTP streams, possibly from multiple 
      RTP sessions. 

   o  MANEs can perform media-aware stream thinning.  By using the 
      payload header information identifying Layers within an RTP 
      session, MANEs are able to remove packets from the incoming RTP 
      packet stream.  This implies rewriting the RTP headers of the 
      outgoing packet stream and rewriting of RTCP Receiver Reports. 

6.2. RTP Header Usage 

   Please see section 5.1 of [RFC3984]. 

6.3. Common Structure of the RTP Payload Format 

   Please see section 5.2 of [RFC3984]. 
 
 
Wenger, et al          Expires December 3, 2008               [Page 17] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

6.4. NAL Unit Header Usage 

   The structure and semantics of the NAL unit header were introduced in 
   section 3.3. .  This section specifies the semantics of F, NRI, I, 
   PRID, DID, QID, TID, U, and D according to this specification. 

   The semantics of F specified in section 5.3 of [RFC3984] also applies 
   herein. 

   For NRI, for the bitstream conforming to one of the profiles defined 
   in Annex A of [H.264] and transported using [RFC3984], the semantics 
   specified in section 5.3 of [RFC3984] are applicable, i.e., NRI also 
   indicates the relative importance of NAL units.  In an SVC context, 
   in addition to the semantics specified in Annex G of [SVC], NRI also 
   indicates the relative importance of NAL units within a layer.  [Edt. 
   Note (YkW): "SVC context" to be clearly specified.] 

   For I, in addition to the semantics specified in Annex G of [SVC], 
   according to this memo, MANEs MAY use this information to protect NAL 
   units with I equal to 1 better than NAL units with I equal to 0.  
   MANEs MAY also utilize information of NAL units with I equal to 1 to 
   decide when to forward more packets for an RTP packet stream. For 
   example, when it is sensed that spatial layer switching has happened 
   such that the operation point has changed to a higher value of DID, 
   MANEs MAY start to forward NAL units with the higher value of DID 
   only after forwarding a NAL unit with I equal to 1 with the higher 
   value of DID. 

   Note that, in the context of this section, "protecting a NAL unit" 
   means any RTP or network transport mechanism that could improve the 
   probability of success delivery of the packet conveying the NAL unit, 
   including applying a QoS-enabled network, Forward Error Correction 
   (FEC), retransmissions, and advanced scheduling behavior, whenever 
   possible. 

   For PRID, the semantics specified in Annex G of [SVC] applies.  Note, 
   that MANEs implementing unequal error protection MAY use this 
   information to protect NAL units with smaller PRID values better than 
   those with larger PRID values, for example by including only the more 
   important NAL units in an FEC protection mechanism.  The importance 
   for the decoding process decreases as the PRID value increases. 

   For DID, QID, TID, in addition to the semantics specified in Annex G 
   of [SVC], according to this memo, values of DID, QID, or TID indicate 
   the relative importance in their respective dimension.  A lower value 
   of DID, QID, or TID indicates a higher importance if the other two 

 
 
Wenger, et al          Expires December 3, 2008               [Page 18] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   components are identical.  MANEs MAY use this information to protect 
   more important NAL units better than less important NAL units. 

   For U, in addition to the semantics specified in Annex G of [SVC], 
   according to this memo, MANEs MAY use this information to protect NAL 
   units with U equal to 1 better than NAL units with U equal to 0. 

   For D, in addition to the semantics specified in Annex G of [SVC], 
   according to this memo, MANEs MAY use this information to determine 
   whether a given NAL unit is required for successfully decoding a 
   certain Operation Point of the SVC bitstream, hence to decide whether 
   to forward the NAL unit. 

6.5. Packetization Modes 

   Section 5.4 of RFC 3984 applies when session multiplexing is not in 
   use.  The packetization modes specified in Section 5.4 of RFC 3984 
   are also referred to as session-specific packetization modes. 

   When session multiplexing is in use, the following applies in 
   addition. 

6.5.1. Packetization Modes for Session Multiplexing 

   This memo specifies four cases of session-multiplexing packetization 
   modes when session multiplexing is in use: 

   o  Non-interleaved timestamp based (NI-T) mode 

   o  Non-interleaved CS-DON based (NI-C) mode 

   o  Non-interleaved combined timestamp and CS-DON (NI-TC) mode 

   o  Interleaved CS-DON (I-C) mode 

   The NI-T, NI-C, and NI-TC modes are targeted for systems that require 
   relatively low end-to-end latency, e.g. conversational systems. In 
   the NI-T, NI-C, and NI-TC modes, NAL units in each RTP session are 
   transmitted in NAL unit decoding order.  [Ed.Note(YkW): Add more 
   introductions for each of the NI-T, NI-C and NI-TC modes.] The I-C 
   mode is targeted for systems that do not require very low end-to-end 
   latency.  The I-C mode allows transmission of NAL units out of NAL 
   unit decoding order in each RTP session. 

   The session-multiplexing packetization mode in use MAY be signaled by 
   the value of the OPTIONAL session-multiplexing-packetization-mode 
   media type parameter or by external means.  When the value of 
 
 
Wenger, et al          Expires December 3, 2008               [Page 19] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   session-multiplexing-packetization-mode is equal to 0, the NI-T mode 
   MUST be used.  When the value of session-multiplexing-packetization-
   mode is equal to 1, the NI-C mode MUST be used.  When the value of 
   session-multiplexing-packetization-mode is equal to 2 or session-
   multiplexing-packetization-mode is not present, the NI-TC mode MUST 
   be used.  When the value of session-multiplexing-packetization-mode 
   is equal to 3, the I-C mode MUST be used.  [Ed.Note(YkW): There MAY 
   be at most one global session-multiplexing-packetization-mode present 
   in the SDP common for all the multiplexed RTP sessions.  It is also 
   possible to have session-multiplexing-packetization-mode session-
   specific in the SDP, but then all the multiplexed sessions MUST have 
   the same value of this parameter.  When session-multiplexing-
   packetization-mode is not present, the NI-TC mode is implied.] 

   The used session-multiplexing packetization mode governs which 
   session-specific packetization modes are allowed in the multiplexed 
   RTP sessions, which in turn govern which NAL unit types are allowed 
   as RTP payloads. 

   Table 3.1 summarizes the allowed session-specific packetization modes 
   for the NI-T, NI-C and NI-TC session-multiplexing packetization 
   modes.  Table 3.2 summarizes the allowed session-specific 
   packetization modes for the I-C session-multiplexing packetization 
   mode. 

    Table 3.1  Summary of allowed session-specific packetization modes 
   for the NI-T, NI-C and NI-TC session-multiplexing packetization modes 
                     (yes = allowed, no = disallowed) 

      Session-Specific Mode    Base Session    Enhancement Session 
      ---------------------------------------------------------- 
      Single NAL Unit Mode         yes             no 
      Non-Interleaved Mode         yes            yes 
      Interleaved Mode              no             no 
    
    Table 3.2  Summary of allowed session-specific packetization modes 
    for the I-C session-multiplexing packetization mode (yes = allowed, 
                             no = disallowed) 

      Session-Specific Mode    Base Session    Enhancement Session 
      ---------------------------------------------------------- 
      Single NAL Unit Mode          no             no 
      Non-Interleaved Mode          no             no 
      Interleaved Mode             yes            yes 
    
   Table 3.3 summarizes the allowed NAL unit types for each allowed 
   session-specific packetization mode of the NI-T session-multiplexing 
 
 
Wenger, et al          Expires December 3, 2008               [Page 20] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   packetization mode.  Table 3.4 summarizes the allowed NAL unit types 
   for each allowed session-specific packetization mode of the NI-C and 
   NI-TC session-multiplexing packetization modes.  Table 3.5 summarizes 
   the allowed NAL unit types for the only allowed session-specific 
   packetization mode (i.e. the interleaved mode) of the I-C session-
   multiplexing packetization mode. 

                                      

      Table 3.3  Summary of allowed NAL unit types for each session-
       specific packetization mode of the NI-T session-multiplexing 
     packetization mode (yes = allowed, no = disallowed, ig = ignore) 

      Type   Packet    Single NAL    Non-Interleaved   
                       Unit Mode           Mode        
      ------------------------------------------------ 
      0      undefined     ig               ig         
      1-23   NAL unit     yes              yes         
      24     STAP-A        no              yes         
      25     STAP-B        no               no         
      26     MTAP16        no               no         
      27     MTAP24        no               no         
      28     FU-A          no              yes         
      29     FU-B          no               no         
      30     PACSI         no               no         
      31     NI-MTAP       no              yes         
    
      Table 3.4  Summary of allowed NAL unit types for each session-
        specific packetization mode of the NI-C and NI-TC session-
   multiplexing packetization modes (yes = allowed, no = disallowed, ig 
                                 = ignore) 

      Type   Packet    Single NAL    Non-Interleaved   
                       Unit Mode           Mode        
      ------------------------------------------------ 
      0      undefined     ig               ig         
      1-23   NAL unit     yes              yes         
      24     STAP-A        no              yes         
      25     STAP-B        no               no         
      26     MTAP16        no               no         
      27     MTAP24        no               no         
      28     FU-A          no              yes         
      29     FU-B          no               no         
      30     PACSI        yes              yes         
      31     NI-MTAP       no              yes         
    
                                      
 
 
Wenger, et al          Expires December 3, 2008               [Page 21] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

                                      

                                      

                                      

   Table 3.5  Summary of allowed NAL unit types for the session-specific 
   packetization mode of the I-C session-multiplexing packetization mode 
               (yes = allowed, no = disallowed, ig = ignore) 

      Type   Packet    Interleaved  
                         Mode       
      ------------------------------ 
      0      undefined     ig        
      1-23   NAL unit      no        
      24     STAP-A        no        
      25     STAP-B       yes        
      26     MTAP16       yes        
      27     MTAP24       yes        
      28     FU-A         yes        
      29     FU-B         yes        
      30     PACSI         no        
      31     undefined     no        
    
   The NAL unit type values indicated as undefined in Tables 3.3, 3.4 
   and 3.5 are reserved for future extensions.  NAL units of those types 
   SHOULD NOT be sent by a sender and MUST be ignored by a receiver.  
   Note that NAL unit type 30 and 31 are indicated as undefined in RFC 
   3984, therefore RFC 3984 receivers MUST ignore NAL units of this 
   type, if present. 

6.6. Decoding Order Number (DON) 

   Section 5.5 of [RFC3984] applies when session multiplexing is not in 
   use. 

   When session multiplexing is in use, the following applies in 
   addition. 

6.6.1. Cross-Session DON (CS-DON) for Session Multiplexing 

   When the NI-C or NI-TC session-multiplexing packetization mode is in 
   use, the packetization of each session MUST be as specified in 
   Section 7.1. , and the following applies for the derivation of the 
   CS-DON value for each non-PACSI NAL unit. 


 
 
Wenger, et al          Expires December 3, 2008               [Page 22] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   o  For each non-PACSI NAL unit carried in a session using the single 
      NAL unit session-specific packetization mode, the CS-DON value of 
      the NAL unit is equal to (DONC_prev_PACSI + SN_diff - 1) % 65536, 
      wherein '%' stands for modulo operation, DONC_prev_PACSI is the 
      DONC value of the previous PACSI NAL unit with the same NALU time 
      as the current NAL unit, and SN_diff is calculated as follows 
      (assuming that the SN values of the current NAL unit and the 
      previous PACSI NAL unit with the same NALU time as the current NAL 
      unit are SN1 and SN2, respectively). 

                 If SN1 > SN2, SN_diff = SN1 - SN2 
                 Else SN_diff = SN2 + 65536 - SN1 

   o  For non-PACSI NAL units carried in a session using the non-
      interleaved session-specific packetization mode, the CS-DON value 
      of each non-PACSI NAL unit is derived as follows. 

       . For a non-PACSI NAL unit in a single NAL unit packet, the 
          following applies. 

            . If the previous PACSI NAL unit is contained in a single 
               NAL unit packet, the CS-DON value of the NAL unit is 
               calculated as above when the single NAL unit session-
               specific packetization mode is in use; 

            . Otherwise (the previous PACSI NAL unit is contained in an 
               STAP-A packet), the CS-DON value of the NAL unit is equal 
               to (the CS-DON value of the previous non-PACSI NAL unit 
               in decoding order + 1) % 65536, wherein '%' stands for 
               modulo operation. 

       . For a non-PACSI NAL unit in an STAP-A packet, the following 
          applies. 

            . If the non-PACSI NAL unit is the first non-PACSI NAL unit 
               in the STAP-A packet, the CS-DON value of the NAL unit is 
               equal to DONC of the PACSI NAL unit in the STAP-A packet; 

            . Otherwise (the non-PACSI NAL unit is not the first non-
               PACSI NAL unit in the STAP-A packet), the CS-DON value of 
               the NAL unit is equal to (the CS-DON value of the 
               previous non-PACSI NAL unit in decoding order + 1) % 
               65536, wherein '%' stands for modulo operation. 




 
 
Wenger, et al          Expires December 3, 2008               [Page 23] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

       . For a non-PACSI NAL unit in a number of FU-A packets, the CS-
          DON value of the NAL unit is calculated as above when the 
          single NAL unit session-specific packetization mode is in use, 
          with SN1 being the SN value of the start FU-A packet. 

   When the I-C session-multiplexing packetization mode is in use, the 
   DON values derived according to RFC 3984 of all the NAL units in each 
   of the multiplexed RTP sessions MUST indicate CS-DON values. 

6.7. Aggregation Packets 

   Please see section 5.7 of [RFC3984]. 

6.8. Fragmentation Units (FUs) 

   Please see section 5.8 of [RFC3984]. 

6.9. Payload Content Scalability Information (PACSI) NAL Unit 

   A new NAL unit type is specified in this memo, and referred to as 
   payload content scalability information (PACSI) NAL unit.  The 
   OPTIONAL PACSI NAL unit, if present, MUST be the first NAL unit in an 
   aggregation packet or the NAL unit in a single NAL unit packet, and 
   it MUST NOT be present in other types of packets.  The PACSI NAL 
   unit, when included in an aggregation packet, indicates scalability 
   information and other characteristics that are common for all the 
   remaining NAL units in the payload of the aggregation packet. 
   Furthermore, a PACSI NAL unit MAY contain zero or more SEI NAL units.  
   PACSI NAL unit makes it easier for MANEs to decide whether to 
   forward/process/discard the aggregation packet containing the PACSI 
   NAL unit.  Other reasons to use PACSI NAL units are explained later 
   when specifying the semantics of the fields.  Senders MAY create 
   PACSI NAL units and receivers MAY ignore them, or use them as hints 
   to enable efficient aggregation packet processing or decoding order 
   recovery in session multiplexing.  Note that the NAL unit type for 
   the PACSI NAL unit is selected among those values that are 
   unspecified in [SVC] and [RFC3984]. 

   When the first aggregation unit of an aggregation packet contains a 
   PACSI NAL unit, there MUST be at least one additional aggregation 
   unit present in the same packet.  The RTP header and payload header 
   fields of the aggregation packet are set according to the remaining 
   NAL units in the aggregation packet. 

   When a PACSI NAL unit is included in a multi-time aggregation packet 
   (MTAP), the decoding order number (DON) for the PACSI NAL unit MUST 
   be set to indicate that the PACSI NAL unit has an identical DON to 
 
 
Wenger, et al          Expires December 3, 2008               [Page 24] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   the first NAL unit in decoding order among the remaining NAL units in 
   the aggregation packet. 

   When a PACSI NAL unit is included in a single NAL unit packet, the 
   RTP header and payload header fields of the packet are set according 
   to the next non-PACSI NAL unit in transmission order. 

   The structure of a PACSI NAL unit is as follows.  The first four 
   octets are exactly the same as the four-byte SVC NAL unit header as 
   discussed in section 3.3. .  They are followed by one always present 
   octet, five optional octets, and zero or more SEI NAL units, each SEI 
   NAL unit preceded by a 16-bit unsigned size field (in network byte 
   order) that indicates the size of the following NAL unit in bytes 
   (excluding these two octets, but including the NAL unit type octet of 
   the SEI NAL unit).  Figure 1 illustrates the PACSI NAL unit structure 
   and an example of a PACSI NAL unit containing two SEI NAL units. 

   The bits A, P, C, S, and E are specified only if the bit X is equal 
   to 1.  The fields TL0PICIDX and IDRPICID are present only if the bit 
   Y is equal to 1.  The fields TL0PICIDX and IDRPICID MUST NOT be 
   present if the bit Y is equal to 0.  The field DONC is present only 
   if the bit T is equal to 1.  The field T MUST be equal to 0 if the 
   aggregation packet containing the PACSI NAL unit is not an STAP-A 
   packet. 























 
 
Wenger, et al          Expires December 3, 2008               [Page 25] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

       0                   1                   2                   3    
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1  
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |F|NRI|  Type   |R|I|   PRID    |N| DID |  QID  | TID |U|D|O| RR| 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |X|Y|T|A|P|C|S|E| TL0PICIDX (o.)|        IDRPICID (o.)          | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |          DONC (o.)            |        NAL unit size 1        | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |                                                               | 
      |                 SEI NAL unit 1                                | 
      |                                                               | 
      |                         +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |                         |        NAL unit size 2        |     | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+     | 
      |                                                               | 
      |            SEI NAL unit 2                                     | 
      |                                           +-+-+-+-+-+-+-+-+-+-+ 
      |                                           | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
             Figure 1  PACSI NAL unit structure.  Fields suffixed by 
                               "(o.)" are OPTIONAL. 

   The values of the fields in PACSI NAL unit MUST be set as follows.  
   The term "target NAL unit" is used in the semantics of some fields.  
   When the PACSI NAL unit is included in an aggregation packet, a 
   "target NAL unit" refers to one or more NAL units that are contained 
   in the aggregation packet, but not included in the PACSI NAL unit 
   itself, that are in the same access unit as the first NAL unit 
   following the PACSI NAL unit in the aggregation packet.  When the 
   PACSI NAL unit is included in a single NAL unit packet, a "target NAL 
   unit" refers to the next non-PACSI NAL unit in transmission order. 

   o  The F bit MUST be set to 1 if the F bit in at least one of the 
      remaining NAL units in the payload of the aggregation packet is 
      equal to 1 (when the PACSI NAL unit is included in an aggregation 
      packet) or if the next non-PACSI NAL unit in transmission order 
      has the F bit equal to 1 (when the PACSI NAL unit is included in a 
      single NAL unit packet).  Otherwise, the F bit MUST be set to 0. 

   o  The NRI field MUST be set to the highest value of NRI field among 
      all the remaining NAL units in the payload of the aggregation 
      packet (when the PACSI NAL unit is included in an aggregation 
      packet) or the value of the NRI field of the next non-PACSI NAL 
      unit in transmission order (when the PACSI NAL unit is included in 
      a single NAL unit packet). 
 
 
Wenger, et al          Expires December 3, 2008               [Page 26] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   o  The Type field MUST be set to 30. 

   o  The R bit MUST be set to 1.  Receivers SHOULD ignore the value of 
      R. 

   o  The I bit MUST be set to 1 if the I bit of at least one of the 
      remaining NAL units in the payload of the aggregation packet is 
      equal to 1 (when the PACSI NAL unit is included in an aggregation 
      packet) or if the I bit of the next non-PACSI NAL unit in 
      transmission order is equal to 1 (when the PACSI NAL unit is 
      included in a single NAL unit packet).  Otherwise, the I bit MUST 
      be set to 0. 

   o  The PRID field MUST be set to the lowest value of the PRID values 
      of all the remaining NAL units in the payload of the aggregation 
      packet (when the PACSI NAL unit is included in an aggregation 
      packet) or the PRID value of the next non-PACSI NAL unit in 
      transmission order (when the PACSI NAL unit is included in a 
      single NAL unit packet). 

   o  The N bit MUST be set to 1 if the N bit of all the remaining NAL 
      units in the payload of the aggregation packet is equal to 1 (when 
      the PACSI NAL unit is included in an aggregation packet) or if the 
      N bit of the next non-PACSI NAL unit in transmission order is 
      equal to 1 (when the PACSI NAL unit is included in a single NAL 
      unit packet).  Otherwise, the N bit MUST be set to 0. 

   o  The DID field MUST be set to the lowest value of the DID values of 
      all the remaining NAL units in the payload of the aggregation 
      packet (when the PACSI NAL unit is included in an aggregation 
      packet) or the DID value of the next non-PACSI NAL unit in 
      transmission order (when the PACSI NAL unit is included in a 
      single NAL unit packet). 

   o  o The QID field MUST be set to the lowest value of the QID values 
      of all the remaining NAL units with the lowest value of DID in the 
      payload of the aggregation packet (when the PACSI NAL unit is 
      included in an aggregation packet) or the QID value of the next 
      non-PACSI NAL unit in transmission order (when the PACSI NAL unit 
      is included in a single NAL unit packet). 

   o  The TID field MUST be set to the lowest value of the TID values of 
      all the remaining NAL units with the lowest value of DID in the 
      payload of the aggregation packet (when the PACSI NAL unit is 
      included in an aggregation packet) or the TID value of the next 
      non-PACSI NAL unit in transmission order (when the PACSI NAL unit 
      is included in a single NAL unit packet). 
 
 
Wenger, et al          Expires December 3, 2008               [Page 27] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   o  The U bit MUST be set to 1 if the U bit of at least one of the 
      remaining NAL units in the payload of the aggregation packet is 
      equal to 1 (when the PACSI NAL unit is included in an aggregation 
      packet) or if the U bit of the next non-PACSI NAL unit in 
      transmission order is equal to 1 (when the PACSI NAL unit is 
      included in a single NAL unit packet).  Otherwise, the U bit MUST 
      be set to 0. 

   o  The D bit MUST be set to 1 if the D value of all the remaining NAL 
      unit in the payload is equal to 1 (when the PACSI NAL unit is 
      included in an aggregation packet) or if the D bit of the next 
      non-PACSI NAL unit in transmission order is equal to 1 (when the 
      PACSI NAL unit is included in a single NAL unit packet).  
      Otherwise, the D bit MUST be set to 0. 

   o  The O bit MUST be set to 1 if the O bit of at least one of the 
      remaining NAL units in the payload of the aggregation packet is 
      equal to 1 (when the PACSI NAL unit is included in an aggregation 
      packet) or if the O bit of the next non-PACSI NAL unit in 
      transmission order is equal to 1 (when the PACSI NAL unit is 
      included in a single NAL unit packet).  Otherwise, the O bit MUST 
      be set to 0. 

   o  The RR field MUST be set to '11' (in binary form).  Receivers 
      SHOULD ignore the value of RR. 

   o  If the X bit is equal to 1, the bits A, P, and C are specified as 
      below. Otherwise, the bits A, P, and C are unspecified, and 
      receivers MUST ignore these bits.  The X bit SHOULD be identical 
      for all the PACSI NAL units in all the RTP sessions carrying the 
      same SVC bitstream. 

   o  If the Y bit is equal to 1, the OPTIONAL fields TL0PICIDX and 
      IDRPICID MUST be present and specified as below, and the bits S 
      and E are also specified as below. Otherwise, the fields TL0PICIDX 
      and IDRPICID MUST NOT be present, whereas the S and E bits are 
      unspecified and receivers MUST ignore these bits.  The Y bit 
      SHOULD be identical for all the PACSI NAL units in all the RTP 
      sessions carrying the same SVC bitstream. 

   o  If the T bit is equal to 1, the OPTIONAL field DONC MUST be 
      present and specified as below. Otherwise, the field DONC MUST NOT 
      be present. 




 
 
Wenger, et al          Expires December 3, 2008               [Page 28] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   o  The A bit MUST be set to 1 if all the target NAL units belong to 
      anchor layer representations.  Otherwise, the A bit MUST be set to 
      0.  The A bit SHOULD be identical for all the PACSI NAL units for 
      which the target NAL units belong to the same access unit. 

      Informative note: The A bit indicates whether CGS or spatial 
      layer switching at a non-IDR layer representation (a layer 
      representation with nal_unit_type not equal to 5 and idr_flag not 
      equal to 1) can be performed.  When the coded pattern like IBBP 
      is in use, non-IDR intra layer representation can be used for 
      random access.  Compared to using only IDR layer representations, 
      higher coding efficiency can be achieved.  The H.264/AVC or SVC 
      solution to indicate the random accessibility of a non-IDR intra 
      layer representation is using recovery point SEI message.  
      However, with this A bit it is much easier to parse than to parse 
      the recovery point SEI message, which may even be buried deeply 
      in an SEI NAL unit.  Furthermore, the SEI message may not be 
      present in the bitstream. 

   o  The P bit MUST be set to 1 if all the remaining NAL units in the 
      payload of the aggregation packet are with redundant_pic_cnt 
      greater than 0 (when the PACSI NAL unit is included in an 
      aggregation packet) or the next non-PACSI NAL unit in transmission 
      order is with redundant_pic_cnt greater than 0 (when the PACSI NAL 
      unit is included in a single NAL unit packet).  Otherwise, the P 
      bit MUST be set to 0. 

      Informative note: The P bit indicates whether a packet can be 
      discarded because it contains only redundant slice NAL units.  
      Without this bit, the corresponding information can be concluded 
      from the syntax element redundant_pic_cnt, which is buried in the 
      variable-length coded slice header. 

   o  The C bit MUST be set to 1 if all the target NAL units belong to 
      intra layer representations.  Otherwise, the C bit MUST be set to 
      0.  The C bit SHOULD be identical for all the PACSI NAL units for 
      which the target NAL units belong to the same access unit. 

      Informative note: The C bit indicates whether a packet contains 
      intra slices which may be the only packets to be forwarded for a 
      fast forward playback, e.g. when the network condition is 
      extremely bad. 





 
 
Wenger, et al          Expires December 3, 2008               [Page 29] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   o  The S bit MUST be set to 1, if the first VCL NAL unit, in decoding 
      order, of the layer representation containing the first NAL unit 
      following the PACSI NAL unit in the aggregation packet is present 
      in the payload (when the PACSI NAL unit is included in an 
      aggregation packet) or if the next non-PACSI NAL unit in 
      transmission order is the first VCL NAL unit, in decoding order, 
      of a layer representation (when the PACSI NAL unit is included in 
      a single NAL unit packet).  Otherwise, the S bit MUST be set to 0. 

   o  The E bit MUST be set to 1, if the last VCL NAL unit, in decoding 
      order, of the layer representation containing the first NAL unit 
      following the PACSI NAL unit in the aggregation packet is present 
      in the payload (when the PACSI NAL unit is included in an 
      aggregation packet) or if the next non-PACSI NAL unit in 
      transmission order is the last VCL NAL unit, in decoding order, of 
      a layer representation (when the PACSI NAL unit is included in a 
      single NAL unit packet).  Otherwise, the E field MUST be set to 0. 

      Informative note: The S or E bit indicates whether the first or 
      last slice, in transmission order, of a layer representation is 
      in a packet, to enable a MANE to detect slice loss and take 
      proper action such as requesting a retransmission as soon as 
      possible, as well as to allow an efficient playout buffer 
      handling similarly as the M bit in the RTP header.  The M bit in 
      the RTP header still indicates the end of an access unit, not the 
      end of a layer representation. 

   o  When present, the TL0PICIDX field MUST be set to equal to 
      tl0_dep_rep_idx as specified in Annex G of [SVC] for the layer 
      representation containing the first NAL unit following the PACSI 
      NAL unit in the aggregation packet (when the PACSI NAL unit is 
      included in an aggregation packet) or containing the next non-
      PACSI NAL unit in transmission order (when the PACSI NAL unit is 
      included in a single NAL unit packet). 

   o  When present, the IDRPICID field MUST be set to equal to 
      effective_idr_pic_id as specified in Annex G of [SVC] for the 
      layer representation containing the first NAL unit following the 
      PACSI NAL unit in the aggregation packet (when the PACSI NAL unit 
      is included in an aggregation packet) or containing the next non-
      PACSI NAL unit in transmission order (when the PACSI NAL unit is 
      included in a single NAL unit packet). 

      Informative note: The TL0PICIDX and IDRPICID fields enable the 
      detection of the loss of layer representations in the most 
      important temporal layer, by receivers as well as MANEs.  SVC 

 
 
Wenger, et al          Expires December 3, 2008               [Page 30] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      includes a solution by using SEI messages, which are harder to 
      parse and may not be present in the bitstream at all. 

   o  When present, the field DONC indicates the cross-session decoding 
      order number (CS-DON) for the first NAL unit of the remaining NAL 
      units in the aggregation packet (when the PACSI NAL unit is 
      included in an aggregation packet) or the CS-DON of the next non-
      PACSI NAL unit in transmission order (when the PACSI NAL unit is 
      included in a single NAL unit packet). 

   The PACSI NAL unit SHALL include a subset (zero to all) of the SEI 
   NAL units associated with the access unit to which the target NAL 
   units belong, and SHALL NOT contain SEI NAL units associated with any 
   other access unit. 

      Informative note: Senders may repeat such SEI NAL units in the 
      PACSI NAL unit the presence of which in more than one packet is 
      essential for packet loss robustness.  Receivers may use the 
      repeated SEI messages in place of missing SEI messages.  In 
      H.264/AVC and SVC, within each access unit, SEI NAL units must 
      appear before any VCL NAL unit in decoding order.  Therefore, 
      without using PACSI NAL units, SEI messages are typically only 
      conveyed in the first packet of those packets conveying an access 
      unit. 

   When the PACSI NAL unit is included in an aggregation packet, an SEI 
   message SHOULD NOT be included in the PACSI NAL unit and included in 
   one of the remaining NAL units contained in the same aggregation 
   packet. 

6.10. Non-Interleaved Multi-Time Aggregation Packets (NI-MTAPs) 

   A new NAL unit payload is introduced in this memo, known as the Non-
   Interleaved Multi-Time Aggregation PACKET (NI-MTAP).  An NI-MTAP 
   consists of zero or more non-interleaved multi-time aggregation 
   units, as presented in Figure 2. 

   Informative note: The rule above differs from the constraint on 
   aggregation packets in [RFC3984] to contain at least one NAL unit.  

   The NI-MTAP consists of 16 bits of unsigned size information of the 
   following NAL unit (in network byte order), and 16 bits (in network 
   byte order) of timestamp offset (TS offset) for this NAL unit. 

   The structure of the multi-time aggregation units for the NI-MTAP is 
   presented in Figure 2.  The starting or ending position of an 
   aggregation unit within a packet is MAY not be on a 32-bit word 
 
 
Wenger, et al          Expires December 3, 2008               [Page 31] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   boundary.  The NAL units in the NI-MTAP are ordered in NAL unit 
   decoding order. 

   The term NALU-time is defined as the value that the RTP timestamp 
   would have if that NAL unit would be transported in its own RTP 
   packet. 

   The timestamp offset field MUST be set to a value equal to the value 
   of the following formula: If the NALU-time is larger than or equal to 
   the RTP timestamp of the packet, then the timestamp offset equals 
   (the NALU-time of the NAL unit - the RTP timestamp of the packet).  
   If the NALU-time is smaller than the RTP timestamp of the packet, 
   then the timestamp offset is equal to the NALU-time + (2^32 - the RTP 
   timestamp of the packet). 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   :        NAL unit size          |        TS offset              | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                                                               | 
   |                         NAL unit                              | 
   |                                                               | 
   |                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                               : 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

          Figure 2  Non-interleaved Multi-time aggregation unit for NI-
                                       MTAP 

   For the "earliest" multi-time aggregation unit in an MTAP the 
   timestamp offset MUST be zero.  Hence, the RTP timestamp of the MTAP 
   itself is identical to the earliest NALU-time. 

   Informative note: The "earliest" multi-time aggregation unit is the 
   one that would have the smallest extended RTP timestamp among all the 
   aggregation units of an MTAP if the aggregation units were 
   encapsulated in single NAL unit packets.  An extended timestamp is a 
   timestamp that has more than 32 bits and is capable of counting the 
   wraparound of the timestamp field, thus enabling one to determine the 
   smallest value if the timestamp wraps.  Such an "earliest" 
   aggregation unit may not be the first one in the order in which the 
   aggregation units are encapsulated in an NI-MTAP.  The "earliest" NAL 
   unit need not be the same as the first NAL unit in the NAL unit 
   decoding order either.  


 
 
Wenger, et al          Expires December 3, 2008               [Page 32] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   Figure 3 presents an example of an RTP packet that contains a NI-MTAP 
   multi-time aggregation packet that contains two non-interleaved 
   multi-time aggregation units, labeled as 1 and 2 in the figure. 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                          RTP Header                           | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |NI-MTAPNAL HDR |            NALU 1 Size        | NALU 1 TS Off.| 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   | NALU 1 TS Off.|  NALU 1 HDR   |    NALU 1 DATA                | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               + 
   :                                                               : 
   ++-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-++ 
   |            NALU 2 SIZE        |       NALU 2 TS Offset        | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |  NALU 2 HDR   |    NALU 2 DATA                                | 
   +-+-+-+-+-+-+-+-+                                               | 
   :                                                               : 
   |                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                               :...OPTIONAL RTP padding        | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

           Figure 3  An RTP packet including a NI-MTAP non-interleaved 
           multi-time aggregation packet and two non-interleaved multi-
                              time aggregation units 

7. Packetization Rules 

   Section 6 of [RFC3984] applies.  The following applies in addition. 

   All receivers MUST support the single NAL unit packetization mode to 
   provide backward compatibility to endpoints supporting only the 
   single NAL unit mode of RFC 3984. However, the use of single NAL unit 
   packetization mode (packetization-mode equal to 0) SHOULD be avoided 
   whenever possible, because encapsulating NAL units of small sizes, 
   e.g. small NAL units containing parameter sets, prefix NAL units, or 
   SEI messages, in their own packets is typically less efficient 
   because of the relatively big overhead. 

   All receivers MUST support the non-interleaved mode of [RFC3984]. 

      Informative note: The non-interleaved mode allows an application 
      to encapsulate a single NAL unit in a single RTP packet.  
      Historically, the single NAL unit mode has been included into 
      [RFC3984] only for compatibility with ITU-T Rec. H.241 Annex A 
 
 
Wenger, et al          Expires December 3, 2008               [Page 33] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      [H.241].  There is no point in carrying this historic ballast 
      towards a new application space such as the one provided with 
      SVC.  More technically speaking, the implementation complexity 
      increase for providing the additional mechanisms of the non-
      interleaved mode (namely STAP-A and FU-A) is minor, and the 
      benefits are great, that STAP-A and FU-A implementation is 
      required. 

   A NAL unit of small size SHOULD be encapsulated in an aggregation 
   packet together with one or more other NAL units. For example, non-
   VCL NAL units such as access unit delimiter, parameter set, or SEI 
   NAL unit are typically small. 

   A prefix NAL unit and the NAL unit with which it is associated, and 
   which follows the prefix NAL unit in decoding order, SHOULD be 
   included in the same aggregation packet whenever an aggregation 
   packet is used for the associated NAL unit. 

      Informative note: When either the prefix NAL unit or the 
      associated NAL unit containing an H.264/AVC coded slice is lost, 
      the remaining one would be hardly useful in SVC context, wherein 
      the prefix NAL unit must be available for decoded picture buffer 
      management operations of the decoding process. 

   When the first aggregation unit of an aggregation packet contains a 
   PACSI NAL unit, there MUST be at least one additional aggregation 
   unit present in the same packet. 

7.1. Packetization Rules for Session Multiplexing 

   When session multiplexing is used, decoding order recovery for NAL 
   units carried in all the multiplexed RTP sessions is needed.  The 
   following packetization rules ensure that decoding order of NAL units 
   carried in the multiplexed sessions can be correctly recovered for 
   each of the session-multiplexing packetization modes according to the 
   de-packetization process specified in Section 8.1. . 

7.1.1. NI-T / NI-TC session-multiplexing packetization rules. 

  When the NI-T or NI-TC session-multiplexing packetization mode is in 
  use, the following applies. 

   o  If one or more NAL units of an access unit of sampling time 
      instance X is present in RTP session A, then one or more NAL units 
      of the same access unit of the same sampling time instance X MUST 
      be present in any enhancement RTP session, which depends on RTP 
      session A.  
 
 
Wenger, et al          Expires December 3, 2008               [Page 34] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      Informative note: 

      There are multiple ways to insert additional NAL units in order 
      to satisfy the rule above, as described below: 

       

      - First option for adding additional NAL units is to place NI-
      MTAP packets as specified in section 6.10. not including any 
      aggregation packet in the payload.  It is important, that the 
      process described in 8.1.1. takes these packets as placeholders 
      for the access unit re-ordering process. 

      - Additional NAL units may be also added by repeating prefix NAL 
      units of NAL unit type 14, before passing NAL units to the 
      decoder, re-ordering of the access unit as described in section 
      7.1.4. is needed.  This may be only possible for access units 
      which contain base layer NAL units.  [Edt.note(TS): It may be 
      useful to indicate in the SDP parameters that additional NAL unit 
      re-ordering as specified in 7.1.4. is not required.] 

      - Additional NAL units may be also added by placing Single NAL 
      unit packets containing exactly one PACSI NAL unit in the 
      enhancement RTP sessions. 

      - Additional NAL units may be also added by the encoder itself, 
      this option may not be possible with pre-encoded content. 

       

   o  When not using NI-TC mode and a PACSI NAL unit is present, the T 
      bit MUST be equal to 0, i.e. the DONC field MUST NOT be present. 

7.1.2. NI-C / NI-TC session-multiplexing packetization mode rules 

   When the NI-C or NI-TC session-multiplexing packetization mode is in 
   use, the following applies. 

   o  For each single NAL unit packet containing a non-PACSI NAL unit, 
      if present, the previous packet MUST have the same RTP timestamp 
      as the single NAL unit packet, and the following applies. 

       . If the NALU time of the non-PACSI NAL unit is not equal to the 
          NALU time of the previous non-PACSI NAL unit in decoding 
          order, the previous packet MUST contain a PACSI NAL unit 
          containing the DONC field; 

 
 
Wenger, et al          Expires December 3, 2008               [Page 35] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

       . Otherwise (the NALU time of the non-PACSI NAL unit is equal to 
          the NALU time of the previous non-PACSI NAL unit in decoding 
          order), the previous packet MAY contain a PACSI NAL unit 
          containing the DONC field. 

   o  For each STAP-A packet, if present, the first NAL unit in the 
      STAP-A packet MUST be a PACSI NAL unit containing the DONC field. 

   o  For each FU-A packet, if present, the previous packet MUST have 
      the same RTP timestamp as the FU-A packet, and the following 
      applies. 

       . If the FU-A packet is the start of the fragmented NAL unit, the 
          following applies; 

            . If the NALU time of the fragmented NAL unit is not equal 
               to the NALU time of the previous non-PACSI NAL unit in 
               decoding order, the previous packet MUST contain a PACSI 
               NAL unit containing the DONC field; 

            . Otherwise (the NALU time of the fragmented NAL unit is 
               equal to the NALU time of the previous non-PACSI NAL unit 
               in decoding order), the previous packet MAY contain a 
               PACSI NAL unit containing the DONC field. 

       . Otherwise if the FU-A packet is the end of the fragmented NAL 
          unit, the following applies. 

            . If the next non-PACSI NAL unit in decoding order has NALU 
               time equal to the NALU time of the fragmented NAL unit, 
               and is carried in a number of FU-A packets or a single 
               NAL unit packet, the next packet MUST be a single NAL 
               unit packet containing a PACSI NAL unit containing the 
               DONC field. 

       . Otherwise (the FU-A packet is neither the start nor the end of 
          the fragmented NAL unit), the previous packet MUST be a FU-A 
          packet. 

   o  For each single NAL unit packet containing a PACSI NAL unit, if 
      present, the PACSI NAL unit MUST contain the DONC field. 

7.1.3. I-C session-multiplexing packetization mode rules 

   When the I-C session-multiplexing packetization mode is in use, the 
   following applies. 

 
 
Wenger, et al          Expires December 3, 2008               [Page 36] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   o  When a PACSI NAL unit is present, the T bit MUST be equal to 0, 
      i.e. the DONC field MUST NOT be present. 

7.1.4. Packetization rules for non-VCL NAL units 

   NAL units which do not directly encode video slices are known in 
   H.264 as Non-VCL NAL units.  Non-VCL units that are only used by, or 
   relevant to, enhancement RTP sessions SHOULD be sent in the lowest 
   session to which they are relevant. 

   However, some senders (e.g., those sending pre-encoded data) might 
   not be able to easily determine which non-VCL units are relevant to 
   which sessions.  Thus, essential non-VCL NAL units (parameter sets 
   sent in-band, i.e. NAL unit types 7, 8, 13, and 15) MAY, instead, be 
   sent in a dependency of the session in which they are used (e.g. the 
   base RTP session), and non-essential non-VCL NAL units MAY be sent in 
   any RTP session. 

   If a non-VCL unit is relevant to more than one RTP session, neither 
   of which is a dependency of the other, the unit MAY be sent in a 
   common dependency of the sessions, or MAY be repeated in both 
   sessions.  In general, identical non-VCL units MAY be sent in more 
   than one session, for redundancy.  [Ed.Note(JL): Can this cause 
   issues with HRD timing?] 

7.1.5. Packetization rules for Prefix NAL units 

   When the base layer is sent on an RTP session using Non-Interleaved 
   or Interleaved mode, Prefix NAL units SHOULD be aggregated (using 
   STAP-A or STAP-B units) with the NAL unit they prefix, unless this 
   would violate session MTU constraints or fragmentation units are in 
   use. 

   If the base layer is sent in a base RTP session using RFC 3984, 
   Prefix NAL units MAY be sent in the lowest enhancement session rather 
   than in the base RTP session. 

8. De-Packetization Process 

   For a single RTP session, the de-packetization process specified in 
   section 7 of [RFC3984] applies [Edt. Note: with some fixes to section 
   7 of RFC 3984 and some changes/additions to section 7.3 (Additional 
   De-Packetization Guidelines) of RFC 3984 - TBD]. 

   For receiving more than one of multiple RTP sessions conveying the 
   same scalable bitstream, the de-packetization process is specified in 
   section 8.1. . 
 
 
Wenger, et al          Expires December 3, 2008               [Page 37] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

8.1. De-Packetization Process for Session Multiplexing 

   As for a single RTP session, the general concept behind these de-
   packetization processes is to reorder NAL units from transmission 
   order to the NAL unit decoding order. 

   The sessions to be received SHALL be identified by mechanisms 
   specified in [I-D.ietf-mmusic-decoding-dependency]. Enhancement RTP 
   sessions typically contain an RTP stream that depends on at least one 
   other RTP session, as indicated by mechanisms defined in [I-D.ietf-
   mmusic-decoding-dependency]. A lower RTP session to an enhancement 
   RTP session is an RTP session which the enhancement RTP session 
   depends on. The lowest RTP session for a receiver is the base RTP 
   session, which does not depend on any other RTP session received by 
   the receiver.  The highest RTP session for a receiver is the RTP 
   session which no other RTP session received by the receiver depends 
   on. 

   For each of the RTP sessions, the RTP reception process as specified 
   in RFC 3550 is applied.  Then the received packets are passed in 
   increasing order of sequence number, into the payload de-
   packetization to NAL units as defined in this memo. 

   The decoding order of the NAL units carried in all the multiplexed 
   RTP sessions is then recovered by applying one of the following 
   subsections, depending on which of the session-multiplexing 
   packetization mode is in use. 

8.1.1. Decoding Order Recovery for the NI-T and NI-TC Modes 

   The following process SHALL be applied when the NI-T session-
   multiplexing packetization mode is in use.  The following process MAY 
   be applied when the NI-TC session-multiplexing packetization mode is 
   in use. 

   The process is based on RTP session dependency signaling, RTP 
   sequence numbers, and timestamps. 

   The decoding order of NAL units from multiple RTP streams in multiple 
   RTP sessions SHALL be recovered into a single sequence of NAL units, 
   grouped into access units, by performing any process equivalent to 
   the following rules: 





 
 
Wenger, et al          Expires December 3, 2008               [Page 38] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   o  The decoding order of NAL units within the RTP session z is given 
      by the order of sequence number x of the RTP packets the NAL units 
      are contained in.  And, in an aggregation packet contained in an 
      RTP packet, the decoding order is given by the appearance of the 
      NAL units NU(y) within the packet, where y is incremented by one 
      per each NAL unit present in decoding order within the RTP session 
      z.  Further, z gives the consecutive order of dependency of the 
      received RTP sessions as indicated by mechanisms specified in 
      9.2.3. , where z equal to 0 identifies the base RTP session.   

   o  Timing information according to the media timestamp TS(x) derived 
      from the RTP packet timestamp of the RTP packet with sequence 
      number x is associated with all NAL units NU(y) contained in the 
      same RTP packet received in RTP session z.  All NAL units NU(y) 
      associated with the same value of media timestamp TS are part of 
      the same access unit AU(TS). 

   o  Each NI-MTAP packet which does not contain any aggregation units 
      or each PACSI NAL unit in a single NAL unit packet SHOULD be kept 
      as placeholder NAL unit in the re-ordering process.  NI-MTAP or 
      PACSI NAL units SHOULD be removed before passing access unit data 
      to the decoder. 

   o  For decoding order recovery, the process as describe below SHALL 
      be applied: 

       o  The process SHOULD be started with the NAL units received in 
          the highest RTP enhancement session h in an RTP packet 
          directly following an RTP packet with the M-bit set to 1, for 
          which other NAL units are available in all the corresponding 
          lower RTP sessions z RTP session h depends on, all received in 
          a consecutive sequence of RTP packets directly following an 
          RTP packet with the M-Bit set to 1: 

       o  Collect all NAL units NU(y) in consecutive order associated 
          with the same value of timestamp TS, starting from the highest 
          RTP enhancement session z in all the (de-jittering) buffers of 
          the received RTP sessions z.  This also includes NAL units 
          extracted from NI-MTAP packets. 

       o  Place the collected NAL units in the consecutive order of z 
          and then in the consecutive order of appearance within session 
          z into access unit AU(TS) associated with timestamp value TS 
          while satisfying the NAL unit order rules in SVC access units 
          as specified in [SVC] and summarized as an informative 
          algorithm in section 7.1.4. . 

 
 
Wenger, et al          Expires December 3, 2008               [Page 39] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

       o  Access units MAY be transferred to the decoder.  If access 
          units AU(TS) are transferred to the decoder, they SHALL be 
          passed in the order of appearance (given by the order of RTP 
          sequence numbers) of timestamp values TS in RTP session h 
          associated with access units AU(TS). 

          Informative Note: Due to packet loss not all NAL units present 
          in all the RTP sessions may be associated with an timestamp 
          value TS present in the highest RTP session h, in such a case 
          an algorithm may  
          a) proceed to the next complete access unit with NAL units 
          present in all the received RTP sessions or  
          b) may assign the value of session n, up to that session 
          starting form session 0 no packet loss is present since the 
          last received and erroneous access unit, to h_new and apply 
          the process described above with h_new instead of h. The 
          original value of h may be re-activated to be used with the 
          process described above starting with a complete and error 
          free access unit with NAL units present in all the originally 
          received RTP sessions. 

   Informative example: 

   The example shown in Figure 4 refers to three RTP sessions A, B and C 
   containing a multiplexed SVC bitstream.  In the example, the 
   dependency signaling as described in 9.2.3. , indicates that Session 
   A is the base RTP session, B is the first enhancement RTP session and 
   depends on A, and C is the second RTP enhancement session and depends 
   on A and B.  In the example, Session A has the lowest frame rate and 
   Session B and C have the same, but a higher frame rate (using a 
   hierarchical prediction structure).  Figure 2. shows an example for 
   de-jitter buffering with different jitters present in the sessions, 
   i.e. at buffering startup not all packets with the same timestamp are 
   available in all the de-jittering buffers (see ,e.g., TS[4]). 

   The process first proceeds to the NAL units associated with first 
   timestamp TS[1] present in session C and removes/ignores all 
   preceding NAL units to NAL units with TS[1] in each of the de-
   jittering buffers of RTP sessions A, B, and C.  Then starting from 
   session C, the first timestamp available in decoding order (TS [1]) 
   is selected and NAL units starting from RTP session A, and sessions B 
   and C are placed in order of the RTP session dependency (in the 
   example for TS[1]: session B -> C) into access unit AU(TS[1]) 
   associated with timestamp TS[1].  Then the next timestamp TS[3] in 
   order of appearance in the highest RTP session C is processed and the 
   process described above is repeated.  Note, that there may be access 
   units with no NAL units present, e.g., in the lowest RTP session A 
 
 
Wenger, et al          Expires December 3, 2008               [Page 40] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   (see, e.g., TS[1]).  With TS[8], the first access unit with NAL units 
   present in all the RTP sessions appears in the buffers. 

   Decoding order and dependency of NAL units per received RTP session 
   with different jitter in sessions at buffering startup time: 

   C: ------------(1,2)-(3,4)--(5)---(6)---(7,8)(9,10)-(11)--(12)---- 
        |     |     |     |     |     |      |    |     |      |      
   B: -(1,2)-(3,4)-(5)---(6)--(7,8)-(9,10)-(11)-(12)--(13,14)(15,15)- 
        |     |                 |     |                 |      |      
   A: -------(1)---------------(2)---(3)---------------(4)----(5)---- 
   -------------------------------------------------------------------> 
   TS: [4]   [2]   [1]   [3]   [8]   [6]   [5]   [7]   [12]   [10]     
    
    
   Key: 
   A, B, C                - RTP sessions 
   Integer values in '()' - NAL unit decoding order per RTP session (y) 
   '( )'                  - groups the NAL units of an access unit  
                            in a RTP session 
   '|'                    - indicates corresponding NAL units of the  
                            same access unit AU(TS[..]) in the RTP  
                            sessions 
   Integer values in '[]' - media Timestamp (TS), sampling time as  
                            derived from RTP timestamps associated to  
                            the access unit AU(TS[..]). 
    
            Figure 4  Example for session multiplexing with different 
                           jitter in session at startup 

8.1.1.1. Informative Algorithm for NI-T Decoding Order Recovery within 
   an Access Unit 

   Within an access unit, the [SVC] specification (specifically, 
   sections 7.4.1.2.3 and G.7.4.1.2.3) constrains the valid decoding 
   order of NAL units fairly tightly.  Due to these constraints, it is 
   possible to reconstruct a valid decoding order for the NAL units of 
   an access unit based only on the order of NAL units in each session, 
   the NAL unit headers, and Supplemental Enhancement Information 
   message headers. 

   This section specifies a non-normative algorithm to reconstruct a 
   valid decoding order for NAL units within an access unit.  Other NAL 
   unit orderings may also be valid; however, any compliant NAL unit 
 
 
Wenger, et al          Expires December 3, 2008               [Page 41] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   ordering will describe the same video stream and ancillary data as 
   the one produced by this algorithm. 

   An actual implementation, of course, needs only to behave "as if" 
   this reordering is done.  In particular, NAL units which are 
   discarded by an implementation's decoding process do not need to 
   first be reordered. 

   In this algorithm, NAL units within an access unit are first ordered 
   by NAL unit type, in the order specified in the list below (other 
   than NAL unit type 14, which is handled specially as described).  NAL 
   units of the same type are then ordered as specified for the type, if 
   necessary. 

   For the purposes of this algorithm, "session order" is the order of 
   NAL units implied by an RTP session.  For the Non-Interleaved and 
   single NAL unit modes, this is RTP sequence number order, and then 
   the order of NAL units within an aggregation unit. 

     o  9           Access unit delimiter 

         Only one access unit delimiter will be present within an access 
         unit. 

     o  7           Sequence parameter set 

         Any order of sequence parameter sets within an access unit is 
         valid. 

     o  13          Sequence parameter set extension 

         Any order of sequence parameter set extensions within an access 
         unit is valid. 

     o  15          Subset sequence parameter set 

         Any order of subset sequence parameter sets within an access 
         unit is valid. 

     o  8           Picture parameter set 

         Any order of picture parameter sets within an access unit is 
         valid. 

     o  6           Supplemental enhancement information (SEI) 


 
 
Wenger, et al          Expires December 3, 2008               [Page 42] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

         If an SEI message with a first payload of 0 (Buffering Period) 
         is present, it must be the first SEI. 

         If SEI messages with a Scalable Nesting (30) payload and a 
         nested payload of 0 (Buffering Period) are present, these then 
         follow.  Such an SEI message with the 
         all_layer_representations_in_au_flag equal to 1 is placed 
         first, followed by any others, sorted in DQId order by the 
         highest DQId mentioned. 

         All other SEI messages follow in any order. 

     o  1           Coded slice of a non-IDR picture 

     o  5           Coded slice of an IDR picture 

     o  14          Prefix NAL unit in scalable extension 

         NAL units of type 1 or 5 will be sent within only a single 
         session for any given access unit. They are placed in session 
         order.  (Note: Any given access unit will contain only NAL 
         units of type 1 or type 5, not both.)  

         If NAL units of type 14 are present, every NAL unit of type 1 
         or 5 is prefixed by a NAL unit of type 14.  (Note: Within an 
         access unit, every NAL unit of type 14 is identical, so 
         correlation of type 14 NAL units with the other NAL units is 
         not necessary.) 

     o  12          Filler data 

     o  14          Prefix NAL unit in scalable extension 

         Any order of filler data units within an access unit is valid. 

         If NAL units of type 14 are present, every filler data NAL unit 
         is prefixed by a NAL unit of type 14. 

     o  2           Coded slice data partition A 

     o  3           Coded slice data partition B 

     o  4           Coded slice data partition C 

         These NAL units will be sent within only a single session for 
         any given access unit, and are placed in session order.  (Note: 
         No current SVC profile uses slice data partitioning.) 
 
 
Wenger, et al          Expires December 3, 2008               [Page 43] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

    

     o  19          Coded slice of an auxiliary coded picture without 
        partitioning 

        These NAL units will be sent within only a single session for 
        any given access unit, and are placed in session order. 

     o  16-18       Reserved 

     o  21-23       Reserved 

         These are placed immediately following the non-reserved-type 
         VCL NAL unit they follow in session order. 

     o  20          Coded slice in scalable extension 

         These are placed in DQId order, based on the D and Q values in 
         the slice's extended NAL unit header.  Within each DQId, they 
         are placed in session order.  (Note: Extension slices with a 
         given DQId value will be sent on a single session for any given 
         access unit.) 

     o  10          End of sequence 

         Only one end of sequence will be present within an access unit. 

     o  11          End of stream 

         Only one end of stream will be present within an access unit. 

    

8.1.2. Decoding Order Recovery for the NI-C, NI-TC and I-C Modes  

   The following process SHALL be used when the NI-C or I-C session-
   multiplexing packetization mode is in use.  The following process MAY 
   be applied when the NI-TC session-multiplexing packetization mode is 
   in use. 

   The RTP packets output from the RTP-level reception processing for 
   each session are placed into the de-session-multiplexing buffer.  
   [Ed.Note(YkW): Add handling of some cases of packet losses when the 
   NI-C or NI-TC mode is in use, that discards some received NAL units 
   for which the CS-DON value cannot be derived.] 


 
 
Wenger, et al          Expires December 3, 2008               [Page 44] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   It is RECOMMENDED to set the size of the de-session-multiplexing 
   buffer, in terms of number of bytes, equal to or greater than the 
   value of the sprop-desemul-buf-req media type parameter of the 
   highest RTP session the receiver receives. 

   The CS-DON value is calculated and stored for each NAL unit. 

   The receiver operation is described below with the help of the 
   following functions and constants: 

   o  Function AbsDON is specified in Section 8.1 of RFC 3984. 

   o  Function don_diff is specified in Section 5.5 of RFC 3984. 

   o  Constant N is the value of the OPTIONAL sprop-session-
      multiplexing-depth media type parameter of the highest RTP session 
      incremented by 1. 

   Initial buffering lasts until one of the following conditions is 
   fulfilled: 

   o  There are N or more VCL NAL units in the de-session-multiplexing 
      buffer. 

   o  If sprop-semul-max-don-diff of the highest SVC RTP session is 
      present, don_diff(m,n) is greater than the value of sprop-semul-
      max-don-diff of the highest RTP session, in which n corresponds to 
      the NAL unit having the greatest value of AbsDON among the 
      received NAL units and m corresponds to the NAL unit having the 
      smallest value of AbsDON among the received NAL units. 

   o  Initial buffering has lasted for the duration equal to or greater 
      than the value of the OPTIONAL sprop-desemul-init-buf-time media 
      type parameter of the highest SVC RTP session. 

   The NAL units to be removed from the de-session-multiplexing buffer 
   are determined as follows: 

   o  If the de-session-multiplexing buffer contains at least N VCL NAL 
      units, NAL units are removed from the de-session-multiplexing 
      buffer and passed to the decoder in the order specified below 
      until the buffer contains N-1 VCL NAL units. 





 
 
Wenger, et al          Expires December 3, 2008               [Page 45] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   o  If sprop-semul-max-don-diff of the highest SVC RTP session is 
      present, all NAL units m for which don_diff(m,n) is greater than 
      sprop-max-don-diff of the highest RTP session are removed from the 
      de-session-multiplexing buffer and passed to the decoder in the 
      order specified below.  Herein, n corresponds to the NAL unit 
      having the greatest value of AbsDON among the NAL units in the de-
      session-multiplexing buffer. 

   The order in which NAL units are passed to the decoder is specified 
   as follows: 

   o  Let PDON be a variable that is initialized to 0 at the beginning 
      of the RTP sessions. 

   o  For each NAL unit associated with a value of CS-DON, a CS-DON 
      distance is calculated as follows.  If the value of CS-DON of the 
      NAL unit is larger than the value of PDON, the CS-DON distance is 
      equal to CS-DON - PDON.  Otherwise, the CS-DON distance is equal 
      to 65535 - PDON + CS-DON + 1. 

   o  NAL units are delivered to the decoder in ascending order of CS-
      DON distance.  If several NAL units share the same value of CS-DON 
      distance, they can be passed to the decoder in any order. 

   o  When a desired number of NAL units have been passed to the 
      decoder, the value of PDON is set to the value of CS-DON for the 
      last NAL unit passed to the decoder. 

9. Payload Format Parameters 

   This section specifies the parameters that MAY be used to select 
   optional features of the payload format and certain features of the 
   bitstream.  The parameters are specified here as part of the media 
   type registration for the SVC codec.  A mapping of the parameters 
   into the Session Description Protocol (SDP) [RFC4566] is also 
   provided for applications that use SDP.  Equivalent parameters could 
   be defined elsewhere for use with control protocols that do not use 
   SDP. 

   Some parameters provide a receiver with the properties of the stream 
   that will be sent.  The names of all these parameters start with 
   "sprop" for stream properties.  Some of these "sprop" parameters are 
   limited by other payload or codec configuration parameters.  For 
   example, the sprop-parameter-sets parameter is constrained by the 
   profile-level-id parameter.  The media sender selects all "sprop" 
   parameters rather than the receiver.  This uncommon characteristic of 
   the "sprop" parameters may not be compatible with some signaling 
 
 
Wenger, et al          Expires December 3, 2008               [Page 46] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   protocol concepts, in which case the use of these parameters SHOULD 
   be avoided. 

9.1. Media Type Registration 

   The media subtype for the SVC codec is allocated from the IETF tree. 

   The receiver MUST ignore any unspecified parameter. 

      Informative note: Requiring that the receiver ignores unspecified 
      parameters allows for backward compatibility of future 
      extensions.  For example, if a future specification that is 
      backward compatible to this specification specifies some new 
      parameters, then a receiver according to this specification is 
      capable of receiving data per the new payload but ignoring those 
      parameters newly specified in the new payload specification.  
      This provision is also present in RFC 3984.  

   Media Type name:     video 

   Media subtype name:  H264-SVC or H264 

   The media subtype "H264" MUST be used for RTP streams using RFC 3984, 
   i.e. not using any of the new features introduced by this 
   specification compared to RFC 3984.  [Edt. Note: The new features are 
   to be listed herein.]  For RTP streams using any of the new features 
   introduced by this specification compared to RFC 3984, the media 
   subtype "H264-SVC" SHOULD be used, and the media subtype "H264" MAY 
   be used.  Use of the media subtype "H264" for RTP streams using the 
   new features allows for RFC 3984 receivers to negotiate and receive 
   H.264/AVC or SVC streams packetized according to this specification, 
   but to ignore media parameters and NAL unit types it does not 
   recognize. 

   Required parameters: none 

   OPTIONAL parameters: 

      profile-level-id: 
         A base16 [RFC3548] (hexadecimal) representation of the 
         following three bytes in the sequence parameter set NAL unit 
         specified in [SVC]: 1) profile_idc, 2) a byte herein referred 
         to as profile-iop, composed of the values of 
         constraint_set0_flag, constraint_set1_flag, 
         constraint_set2_flag, constraint_set3_flag, and 
         reserved_zero_4bits in bit-significance order, starting from 
         the most significant bit, and 3) level_idc.  Note that 
 
 
Wenger, et al          Expires December 3, 2008               [Page 47] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

         reserved_zero_4bits is required to be equal to 0 in [SVC], but 
         other values for it may be specified in the future by ITU-T or 
         ISO/IEC. 

         If the profile-level-id parameter is used to indicate 
         properties of a NAL unit stream, it indicates the profile and 
         level that a decoder has to support in order to comply with 
         [SVC] when it decodes the NAL unit stream.  The profile-iop 
         byte indicates whether the NAL unit stream also obeys all the 
         constraints as specified in subsection G.7.4.2.1.1 of [SVC].  
         Herein the NAL unit stream refers to the one consisting of all 
         NAL units conveyed in the current RTP session, and all NAL 
         units conveyed in other RTP sessions, if present, the current 
         RTP session depends on.  The current RTP session MAY depend on 
         other RTP sessions when a scalable bitstream is transported 
         with more than one RTP session and the current session is not 
         an independent RTP session. 

         If the profile-level-id parameter is used for capability 
         exchange or session setup procedure, it indicates the profile 
         that the codec supports and the highest level supported for 
         the signaled profile.  The profile-iop byte indicates whether 
         the codec has additional limitations whereby only the common 
         subset of the algorithmic features and limitations signaled 
         with the profile-iop byte is supported by the codec.  For 
         example, if a codec supports only the common subset of the 
         coding tools of the Baseline profile and the Main profile at 
         level 2.1 and below, the profile-level-id becomes 42E015, in 
         which 42 stands for the Baseline profile, E0 indicates that 
         only the common subset for all profiles is supported, and 15 
         indicates level 2.1. 

            Informative note: Capability exchange and session setup 
            procedures should provide means to list the capabilities 
            for each supported codec profile separately.  For example, 
            the one-of-N codec selection procedure of the SDP 
            Offer/Answer model can be used (section 10.2 of [RFC4566]). 

         If no profile-level-id is present, the Baseline Profile 
         without additional constraints at Level 1 MUST be implied. 

      max-mbps, max-fs, max-cpb, max-dpb, and max-br: 
         The common property of these parameters is as specified in RFC 
         3984. 

      max-mbps: This parameter is as specified in RFC 3984. 

 
 
Wenger, et al          Expires December 3, 2008               [Page 48] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      max-fs: This parameter is as specified in RFC 3984. 

      max-cpb: The value of max-cpb is an integer indicating the 
         maximum coded picture buffer size in units of 1000 bits for 
         the VCL HRD parameters (see A.3.1 item i or G.10.2.2 item g of 
         [SVC]) and in units of 1200 bits for the NAL HRD parameters 
         (see A.3.1 item j or G.10.2.2 item h of [SVC]).  The max-cpb 
         parameter signals that the receiver has more memory than the 
         minimum amount of coded picture buffer memory required by the 
         signaled level conveyed in the value of the profile-level-id 
         parameter.  When max-cpb is signaled, the receiver MUST be 
         able to decode NAL unit streams that conform to the signaled 
         level, with the exception that the MaxCPB value in Table A-1 
         of [SVC] for the signaled level is replaced with the value of 
         max-cpb.  The value of max-cpb MUST be greater than or equal 
         to the value of MaxCPB for the level given in Table A-1 of 
         [SVC].  Senders MAY use this knowledge to construct coded 
         video streams with greater variation of bit rate than can be 
         achieved with the MaxCPB value in Table A-1 of [SVC]. 

            Informative note: The coded picture buffer is used in the 
            hypothetical reference decoder (Annex C) of [SVC].  The use 
            of the hypothetical reference decoder is recommended in SVC 
            encoders to verify that the produced bitstream conforms to 
            the standard and to control the output bitrate.  Thus, the 
            coded picture buffer is conceptually independent of any 
            other potential buffers in the receiver, including de-
            interleaving and de-jitter buffers.  The coded picture 
            buffer need not be implemented in decoders as specified in 
            Annex C of [SVC], but rather standard-compliant decoders 
            can have any buffering arrangements provided that they can 
            decode standard-compliant bitstreams.  Thus, in practice, 
            the input buffer for video decoder can be integrated with 
            de-interleaving and de-jitter buffers of the receiver. 

      max-dpb: This parameter is as specified in RFC 3984. 

      max-br: The value of max-br is an integer indicating the maximum 
         video bit rate in units of 1000 bits per second for the VCL 
         HRD parameters (see A.3.1 item i or G.10.2.2 item g of [SVC]) 
         and in units of 1200 bits per second for the NAL HRD 
         parameters (see A.3.1 item j or G.10.2.2 item h of [SVC]). 

         The max-br parameter signals that the video decoder of the 
         receiver is capable of decoding video at a higher bit rate 
         than is required by the signaled level conveyed in the value 
         of the profile-level-id parameter. 
 
 
Wenger, et al          Expires December 3, 2008               [Page 49] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

         When max-br is signaled, the video codec of the receiver MUST 
         be able to decode NAL unit streams that conform to the 
         signaled level, conveyed in the profile-level-id parameter, 
         with the following exceptions in the limits specified by the 
         level: 

         o The value of max-br replaces the MaxBR value of the signaled 
            level (in Table A-1 of [SVC]). 

         o When the max-cpb parameter is not present, the result of the 
            following formula replaces the value of MaxCPB in Table A-1 
            of [SVC]: (MaxCPB of the signaled level) * max-br / (MaxBR 
            of the signaled level). 

         For example, if a receiver signals capability for Level 1.2 
         with max-br equal to 1550, this indicates a maximum video 
         bitrate of 1550 kbits/sec for VCL HRD parameters, a maximum 
         video bitrate of 1860 kbits/sec for NAL HRD parameters, and a 
         CPB size of 4036458 bits (1550000 / 384000 * 1000 * 1000). 

         The value of max-br MUST be greater than or equal to the value 
         MaxBR for the signaled level given in Table A-1 of [SVC]. 

         Senders MAY use this knowledge to send higher bitrate video as 
         allowed in the level definition of SVC, to achieve improved 
         video quality. 

            Informative note: This parameter was added primarily to 
            complement a similar codepoint in the ITU-T Recommendation 
            H.245, so as to facilitate signaling gateway designs.  No 
            assumption can be made from the value of this parameter 
            that the network is capable of handling such bit rates at 
            any given time.  In particular, no conclusion can be drawn 
            that the signaled bit rate is possible under congestion 
            control constraints. 

      redundant-pic-cap: 
         This parameter is as specified in RFC 3984. 

      sprop-parameter-sets: 
         This parameter MAY be used to convey any sequence parameter 
         set, subset sequence parameter set and picture parameter set 
         NAL units (herein referred to as the initial parameter set NAL 
         units) that MUST be placed in the NAL unit stream to precede 
         any other NAL units in decoding order by the receiver.  The 
         parameter MUST NOT be used to indicate codec capability in any 
         capability exchange procedure.  The value of the parameter is 
 
 
Wenger, et al          Expires December 3, 2008               [Page 50] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

         the base64 [RFC3548] representation of the initial parameter 
         set NAL units as specified in sections 7.3.2.1, 7.3.2.2 and 
         G.7.3.2.1 of [SVC].  The parameter sets are conveyed in 
         decoding order, and no framing of the parameter set NAL units 
         takes place.  A comma is used to separate any pair of 
         parameter sets in the list.  Note that the number of bytes in 
         a parameter set NAL unit is typically less than 10, but a 
         picture parameter set NAL unit can contain several hundreds of 
         bytes. 

            Informative note: When several payload types are offered in 
            the SDP Offer/Answer model, each with its own sprop-
            parameter-sets parameter, then the receiver cannot assume 
            that those parameter sets do not use conflicting storage 
            locations (i.e., identical values of parameter set 
            identifiers).  Therefore, a receiver should double-buffer 
            all sprop-parameter-sets and make them available to the 
            decoder instance that decodes a certain payload type. 

      parameter-add:  
         This parameter is as specified in RFC 3984. 

      packetization-mode:  
         This parameter is as specified in RFC 3984. 

      sprop-interleaving-depth:  
         This parameter is as specified in RFC 3984. 

      sprop-deint-buf-req: 
         This parameter is as specified in RFC 3984. 

      deint-buf-cap: 
         This parameter is as specified in RFC 3984. 

      sprop-init-buf-time: 
         This parameter is as specified in RFC 3984. 

      sprop-max-don-diff: 
         This parameter is as specified in RFC 3984. 

      max-rcmd-nalu-size: 
         This parameter is as specified in RFC 3984. 

      session-multiplexing-packetization-mode: 
         This parameter signals the properties of a NAL unit stream 
         carried in more than one RTP session using session 
         multiplexing or the capabilities of a receiver implementation.  
 
 
Wenger, et al          Expires December 3, 2008               [Page 51] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

         When the value of session-multiplexing-packetization-mode is 
         equal to 0, the NI-T mode MUST be used.  When the value of 
         session-multiplexing-packetization-mode is equal to 1, the NI-
         C mode MUST be used.  When the value of session-multiplexing-
         packetization-mode is equal to 2 or session-multiplexing-
         packetization-mode is not present, the NI-TC mode MUST be 
         used.  When the value of session-multiplexing-packetization-
         mode is equal to 3, the I-C mode MUST be used.  The value of 
         session-multiplexing-packetization-mode MUST be an integer in 
         the range of 0 to 3, inclusive. 

      sprop-session-multiplexing-depth: 
         This parameter MUST NOT be present when the value of session-
         multiplexing-packetization-mode is equal to 0.  This parameter 
         MUST be present when the value of session-multiplexing-
         packetization-mode is larger than 0 or session-multiplexing-
         packetization-mode is not present. 

         This parameter signals the properties of a NAL unit stream 
         carried in the current RTP session and the RTP sessions the 
         current RTP session depends on.  It is guaranteed that 
         receivers can reconstruct NAL unit decoding order as specified 
         in Subsection 8.1.2.  of this memo when the de-session-
         multiplexing buffer size is at least the value of sprop-
         session-multiplexing-depth + 1 in terms of VCL NAL units. 

         The value of sprop-session-multiplexing-depth MUST be an 
         integer in the range of 0 to 32767, inclusive. 

      sprop-desemul-buf-req: 
         This parameter MUST NOT be present when the value of session-
         multiplexing-packetization-mode is equal to 0.  It MUST be 
         present when session-multiplexing-packetization-mode is not 
         present or the value of session-multiplexing-packetization-
         mode is larger than 0. 

         sprop-desemul-buf-req signals the required size of the de-
         session-multiplexing buffer for the NAL unit stream carried in 
         the current RTP session and the RTP sessions the current RTP 
         session depends on.  It is guaranteed that receivers can 
         recover the decoding order of the received NAL units from the 
         current RTP session and the RTP sessions the current RTP 
         session depends on as specified in section 8.1.2. , when the 
         de-session-multiplexing buffer size is at least the value of 
         sprop-desemul-buf-req in terms of bytes. 


 
 
Wenger, et al          Expires December 3, 2008               [Page 52] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

         The value of sprop-desemul-buf-req MUST be an integer in the 
         range of 0 to 4294967295, inclusive. 

      desemul-buf-cap: 
         This parameter signals the capabilities of a receiver 
         implementation and indicates the amount of de-session-
         multiplexing buffer space in units of bytes that the receiver 
         has available for recovering the NAL unit decoding order as 
         specified in section 8.1.2. .  A receiver is able to handle 
         any NAL unit stream for which the value of the sprop-desemul-
         buf-req parameter is smaller than or equal to this parameter. 

         If the parameter is not present, then a value of 0 MUST be 
         used for desemul-buf-cap.  The value of desemul-buf-cap MUST 
         be an integer in the range of 0 to 4294967295, inclusive. 

      sprop-desemul-init-buf-time: 
         This parameter MAY be used to signal the properties of a NAL 
         unit stream carried in the current RTP session and the RTP 
         sessions the current RTP session depends on.  The parameter 
         MUST NOT be present if session-multiplexing-packetization-mode 
         is not present or the value of session-multiplexing-
         packetization-mode is larger than 0. 

         The parameter signals the initial buffering time that a 
         receiver MUST wait before starting to recover the NAL unit 
         decoding order as specified in Subsection 8.1.2.  of this 
         memo. 

         The parameter is coded as a non-negative base10 integer 
         representation in clock ticks of a 90-kHz clock.  If the 
         parameter is not present, then no initial buffering time value 
         is defined.  Otherwise the value of sprop-desemul-init-buf-
         time MUST be an integer in the range of 0 to 4294967295, 
         inclusive. 

      sprop-semul-max-don-diff: 
         This parameter MAY be used to signal the properties of a NAL 
         unit stream carried in the current RTP session and the RTP 
         sessions the current RTP session depends on.  It MUST NOT be 
         used to signal transmitter or receiver or codec capabilities.  
         The parameter MUST NOT be present if the value of session-
         multiplexing-packetization-mode is equal to 0.  sprop-semul-
         max-don-diff is an integer in the range of 0 to 32767, 
         inclusive.  If sprop-semul-max-don-diff is not present, the 
         value of the parameter is unspecified.  sprop-semul-max-don-
         diff is calculated same as sprop-max-don-diff as specified in 
 
 
Wenger, et al          Expires December 3, 2008               [Page 53] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

         RFC 3984, with decoding order number being replaced by cross-
         session decoding order number. 

      sprop-prebuf-size: 
         This parameter MAY be present when the current RTP session 
         depends on any other RTP session.  This parameter MUST NOT be 
         present when session-multiplexing-packetization-mode is not 
         present or the value of session-multiplexing-packetization-
         mode is larger than 0.  sprop-prebuf-size MAY signal the 
         required size of the receiver buffer for the NAL unit stream 
         per RTP session.  This parameter may be useful to compensate 
         the impact of inter-RTP session jitter, when the receiver 
         buffer size is at least the value of sprop-prebuf-size in 
         terms of bytes.  Herein the NAL unit stream refers to the one 
         consisting of all NAL units conveyed in the current RTP 
         session. 

         The value of sprop-prebuf-size MUST be an integer in the range 
         of 0 to 4294967295, inclusive. 

            Informative note: sprop-prebuf-size indicates the required 
            size of the prebuffering receiver buffer only.  When 
            network jitter can occur, an appropriately sized jitter 
            buffer has to be provisioned for as well.  When a scalable 
            bitstream is conveyed in more than one RTP session, and the 
            sessions initiates at different time, the session 
            initiation variation has also to be compensated by an 
            appropriately sized buffer.  

      sprop-prebuf-time: 
         This parameter MAY be used to signal the properties of a NAL 
         unit stream within a session multiplexing.  Herein the NAL 
         unit stream refers to the one consisting of all NAL units 
         conveyed in the current RTP session.  This parameter MUST NOT 
         be present when session-multiplexing-packetization-mode is not 
         present or the value of session-multiplexing-packetization-
         mode is larger than 0. 

         The parameter signals the initial buffering time used for a 
         receiver before starting to recover the NAL unit decoding 
         order for more than one RTP session. The parameter is the 
         maximum value of (transmission time of a NAL unit - decoding 
         time of the NAL unit), assuming reliable and instantaneous 
         transmission, the same timeline for transmission and decoding, 
         and that decoding starts when the first packet arrives. 


 
 
Wenger, et al          Expires December 3, 2008               [Page 54] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

         The parameter is coded as a non-negative base10 integer 
         representation in clock ticks of a 90-kHz clock.  If the 
         parameter is not present, then no initial buffering time value 
         is defined.  Otherwise the value of sprop-prebuf-time MUST be 
         an integer in the range of 0 to 4294967295, inclusive. 

         In addition to the signaled sprop-prebuf-time, receivers 
         SHOULD take into account the transmission delay jitter 
         buffering, including buffering for the delay jitter caused by 
         mixers, translators, gateways, proxies, traffic-shapers, and 
         other network elements.  Yet another aspect receivers SHOULD 
         take into account is the session initiation variation when a 
         scalable bitstream is conveyed in more than one session, 
         including buffering the variation. 

         [Ed.Note(YkW): Need to discuss how inter-RTP session jitter 
         should be handled in general, and how it works by using sprop-
         prebuf-size and sprop-prebuf-time.] 

      sprop-scalability-info: 
         This parameter MAY be used to convey the NAL unit containing 
         the scalability information SEI message as specified in Annex 
         G of [SVC].  This parameter MAY be used to signal the 
         contained Layers of an SVC bitstream.  The parameter MUST NOT 
         be used to indicate codec capability in any capability 
         exchange procedure.  The value of the parameter is the base64 
         representation of the NAL unit containing the scalability 
         information SEI message.  If present, the NAL unit MUST 
         contain only a scalability information SEI message. 

         This parameter MAY be used in an offering or declarative SDP 
         message to indicate what Layers can be provided.  A receiver 
         MAY indicate its choice of one Layer using the optional media 
         type parameter scalable-layer-id. 

      sprop-layer-range: 
         This parameter MAY be used to signal two sets of the layer 
         identification values of the lowest and highest operation 
         points conveyed in the RTP session.  Each set is a base16 
         representation of a three-character value, with the first 
         character representing DID, the second character representing 
         QID, and the third character representing TID.  The two sets 
         are comma separated.  Let DIDl and DIDh be the least DID value 
         and the greatest DID value, respectively, among all the NAL 
         units conveyed in the RTP session. Let QIDl and TIDl be the 
         least QID value and the least TID value, respectively, among 
         all the NAL units that are conveyed in the RTP session and 
 
 
Wenger, et al          Expires December 3, 2008               [Page 55] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

         that have DID equal to DIDl. Let QIDh and TIDh be the greatest 
         QID value and the great TID value, respectively, among all the 
         NAL units that are conveyed in the RTP session and that have 
         DID equal to DIDh.  The first set indicates the DID, QID and 
         TID values of the lowest operation point, for which the DID, 
         QID and TID values are equal to DIDl, QIDl, and TIDl, 
         respectively.  The second set indicates the DID, QID and TID 
         values of the highest operation point, for which the DID, QID 
         and TID values are equal to DIDh, QIDh, and TIDh, 
         respectively. 

      scalable-layer-id: 
         This parameter MAY be used to signal a receiver's choice of 
         the offers or declared operation points or layers using sprop-
         scalability-info.  The value of scalable-layer-id is a base16 
         representation of the layer_id[ i ] syntax element in the 
         scalability information SEI message as specified in [SVC]. 

         [Edt. Note (TS): That is, a SDP capable receiver/middle-box 
         must decode the sprop-scalabiltiy-info syntax, which is not 
         specified in this memo, to select a scalable-layer-id. This is 
         currently not addressed in the offer answer section!] 

      sprop-spatial-resolution: 
         [Edt. Note: I know that framerate and bitrate SDP parameters 
         are already available, but failed to find a spatial resolution 
         SDP parameter. It would be good if this is already defined. 
         Otherwise, it would be better to be defined somewhere else 
         because it is a generic parameter.] 

         This parameter MAY be used to indicate the property of a 
         stream or the capability of a receiver or sender 
         implementation.  The value is a base16 of the width and height 
         of the spatial resolution, in pixels, separated by a comma.  

         [Edt. Note (TS): Shouldn't this be a generic SDP parameter?] 

      Encoding considerations: 
         This type is only defined for transfer via RTP (RFC 3550). 

      Security considerations: 
         See section 10.  of RFC XXXX. 

      Public specification: 
         Please refer to RFC XXXX and its section 14. . 


 
 
Wenger, et al          Expires December 3, 2008               [Page 56] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      Additional information: 
         None 

      File extensions:     none 

      Macintosh file type code: none 

      Object identifier or OID: none 

      Person & email address to contact for further information: 

      Intended usage:      COMMON 

      Author: 

      Change controller: 
         IETF Audio/Video Transport working group delegated from the 
         IESG. 

9.2. SDP Parameters 

   [Edt. Note: For agreeing on a Layer or OP in unicast, an SDP can 
   contain multiple m lines with bitrate, framerate and spatial 
   resolution parameters available, in addition to sprop-scalability-
   info. The receive can select one of the m lines, or, for operation 
   points that are not included in the m lines, one of the "scalable 
   layers" specified by sprop-scalabiltiy-info using scalable-layer-id. 

   For layered multicast, then the grouping signaling in I-D.ietf-
   mmusic-decoding-dependency is needed. 

   The above would conveniently support also the normal ROI use cases 
   (with a few ROIs each indicated as a "scalable layer") but not the 
   interactive ROI use cases.  The quality layer using priority_id use 
   cases are not supported either. That would need one more optional 
   media type parameter, to identify a quality layer.  The lightweight 
   transcoding use cases should be supported well by using (multiple) 
   normal AVC SDP offering messages.] 

9.2.1. Mapping of Payload Type Parameters to SDP 

   The media type video/H264-SVC string is mapped to fields in the 
   Session Description Protocol (SDP) as follows: 

   o  The media name in the "m=" line of SDP MUST be video. 


 
 
Wenger, et al          Expires December 3, 2008               [Page 57] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   o  The encoding name in the "a=rtpmap" line of SDP MUST be H264-SVC 
      (the media subtype). 

   o  The clock rate in the "a=rtpmap" line MUST be 90000. 

   o  The OPTIONAL parameters "profile-level-id", "max-mbps", "max-fs", 
      "max-cpb", "max-dpb", "max-br", "redundant-pic-cap", "sprop-
      parameter-sets", "parameter-add", "packetization-mode", "sprop-
      interleaving-depth", "deint-buf-cap", "sprop-deint-buf-req", 
      "sprop-init-buf-time", "sprop-max-don-diff", "max-rcmd-nalu-size", 
      "session-multiplexing-packetization-mode", "sprop-session-
      multiplexing-depth", "sprop-desemul-buf-req", "desemul-buf-cap", 
      "sprop-desemul-init-buf-time", "sprop-semul-max-don-diff", "sprop-
      prebuf-size", "sprop-prebuf-time", "sprop-layer-range", "sprop-
      scalability-info", "scalable-layer-id", and "sprop-spatial-
      resolution", when present, MUST be included in the "a=fmtp" line 
      of SDP.  These parameters are expressed as a media type string, in 
      the form of a semicolon separated list of parameter=value pairs. 

9.2.2. Usage with the SDP Offer/Answer Model 

   When H.264 or SVC is offered over RTP using SDP in an Offer/Answer 
   model [RFC3264] for negotiation for unicast usage, the following 
   limitations and rules apply: 

   o  The parameters identifying a media format configuration for H.264 
      or SVC are "profile-level-id", "packetization-mode", and, if 
      required by "packetization-mode", "sprop-deint-buf-req".  These 
      three parameters MUST be used symmetrically; i.e., the answerer 
      MUST either maintain all configuration parameters or remove the 
      media format (payload type) completely, if one or more of the 
      parameter values are not supported. 

         Informative note: The requirement for symmetric use applies 
         only for the above three parameters and not for the other 
         stream properties and capability parameters. 

      To simplify handling and matching of these configurations, the 
      same RTP payload type number used in the offer SHOULD also be 
      used in the answer, as specified in [RFC3264].  An answer MUST 
      NOT contain a payload type number used in the offer unless the 
      configuration ("profile-level-id", "packetization-mode", and, if 
      present, "sprop-deint-buf-req") is the same as in the offer. 

         Informative note: An offerer, when receiving the answer, has 
         to compare payload types not declared in the offer based on 
         media type (i.e., video/H264-SVC) and the above three 
 
 
Wenger, et al          Expires December 3, 2008               [Page 58] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

         parameters with any payload types it has already declared, in 
         order to determine whether the configuration in question is 
         new or equivalent to a configuration already offered. 

      An answerer MAY select from the layers offered in the "sprop-
      scalability-information" parameter by including "scalable-layer-
      id" or "sprop-layer-range" in the answer.[Edt. Note: do we need 
      to additionally define behavior with snd/rcvonly parameter?] 

   o  The parameters "sprop-parameter-sets", "sprop-deint-buf-req", 
      "sprop-interleaving-depth", "sprop-max-don-diff", "sprop-init-buf-
      time", "sprop-prebuf-size", "sprop-prebuf-time", "sprop-
      scalability-information", "sprop-layer-range" describe the 
      properties of the NAL unit stream that the offerer or answerer is 
      sending for this media format configuration.  This differs from 
      the normal usage of the Offer/Answer parameters: normally such 
      parameters declare the properties of the stream that the offerer 
      or the answerer is able to receive.  When dealing with H.264 or 
      SVC, the offerer assumes that the answerer will be able to receive 
      media encoded using the configuration being offered. 

         Informative note: The above parameters apply for any stream 
         sent by the declaring entity with the same configuration; 
         i.e., they are dependent on their source.  Rather then being 
         bound to the payload type, the values may have to be applied 
         to another payload type when being sent, as they apply for the 
         configuration. 

   o  The capability parameters ("max-mbps", "max-fs", "max-cpb",  
      "max-dpb", "max-br", ,"redundant-pic-cap", "max-rcmd-nalu-size") 
      MAY be used to declare further capabilities.  Their interpretation 
      depends on the direction attribute.  When the direction attribute 
      is sendonly, then the parameters describe the limits of the RTP 
      packets and the NAL unit stream that the sender is capable of 
      producing.  When the direction attribute is sendrecv or recvonly, 
      then the parameters describe the limitations of what the receiver 
      accepts. 










 
 
Wenger, et al          Expires December 3, 2008               [Page 59] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   o  As specified above, an offerer has to include the size of the 
      deinterleaving buffer in the offer for an interleaved H.264 or SVC 
      stream.  To enable the offerer and answerer to inform each other 
      about their capabilities for deinterleaving buffering, both 
      parties are RECOMMENDED to include "deint-buf-cap".  This 
      information MAY be used when the value for "sprop-deint-buf-req" 
      is selected in a second round of offer and answer.  For 
      interleaved streams, it is also RECOMMENDED to consider offering 
      multiple payload types with different buffering requirements when 
      the capabilities of the receiver are unknown. 

   o  The "sprop-parameter-sets" parameter is used as described above.  
      In addition, an answerer MUST maintain all parameter sets received 
      in the offer in its answer.  Depending on the value of the 
      "parameter-add" parameter, different rules apply: If "parameter-
      add" is false (0), the answer MUST NOT add any additional 
      parameter sets.  If "parameter-add" is true (1), the answerer, in 
      its answer, MAY add additional parameter sets to the "sprop-
      parameter-sets" parameter.  The answerer MUST also, independent of 
      the value of "parameter-add", accept to receive a video stream 
      using the sprop-parameter-sets it declared in the answer. 

         Informative note: care must be taken when parameter sets are 
         added not to cause overwriting of already transmitted 
         parameter sets by using conflicting parameter set identifiers. 

   For streams being delivered over multicast, the following rules apply 
   in addition: 

   o  The stream properties parameters ("sprop-parameter-sets", "sprop- 
      deint-buf-req", "sprop-interleaving-depth", "sprop-max-don-diff", 
      "sprop-init-buf-time", "sprop-prebuf-size", "sprop-prebuf-time", 
      "sprop-scalability-information", and "sprop-layer-range") MUST NOT 
      be changed by the answerer.  Thus, a payload type can either be 
      accepted unaltered or removed. 

   o  The receiver capability parameters "max-mbps", "max-fs", "max-
      cpb", "max-dpb", "max-br", and "max-rcmd-nalu-size" MUST be 
      supported by the answerer for all streams declared as sendrecv or 
      recvonly; otherwise, one of the following actions MUST be 
      performed: the media format is removed, or the session rejected. 






 
 
Wenger, et al          Expires December 3, 2008               [Page 60] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   o  The receiver capability parameter redundant-pic-cap SHOULD be 
      supported by the answerer for all streams declared as sendrecv or 
      recvonly as follows:  The answerer SHOULD NOT include redundant 
      coded pictures in the transmitted stream if the offerer indicated 
      redundant-pic-cap equal to 0.  Otherwise (when redundant_pic_cap 
      is equal to 1), it is beyond the scope of this memo to recommend 
      how the answerer should use redundant coded pictures. 

   Below are the complete lists of how the different parameters shall be 
   interpreted in the different combinations of offer or answer and 
   direction attribute. 

   o  In offers and answers for which "a=sendrecv" or no direction 
      attribute is used, or in offers and answers for which "a=recvonly" 
      is used, the following interpretation of the parameters MUST be 
      used. 

      Declaring actual configuration or properties for receiving: 

         - profile-level-id 
         - packetization-mode 

      Declaring actual properties of the stream to be sent (applicable 
      only when "a=sendrecv" or no direction attribute is used): 

         - sprop-deint-buf-req 
         - sprop-interleaving-depth 
         - sprop-parameter-sets 
         - sprop-max-don-diff 
         - sprop-init-buf-time 
         - sprop-prebuf-size 
         - sprop-prebuf-time 
         - sprop-scalability-information 
         - sprop-layer-range 
         - scalable-layer-id 

      Declaring receiver implementation capabilities: 

         - max-mbps 
         - max-fs 
         - max-cpb 
         - max-dpb 
         - max-br 
         - redundant-pic-cap 
         - deint-buf-cap 
         - max-rcmd-nalu-size 

 
 
Wenger, et al          Expires December 3, 2008               [Page 61] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      Declaring how Offer/Answer negotiation shall be performed: 

         - parameter-add 

   o  In an offer or answer for which the direction attribute 
      "a=sendonly" is included for the media stream, the following 
      interpretation of the parameters MUST be used: 

      Declaring actual configuration and properties of stream proposed 
      to be sent: 

         - profile-level-id 
         - packetization-mode 
         - sprop-deint-buf-req 
         - sprop-max-don-diff 
         - sprop-init-buf-time 
         - sprop-parameter-sets 
         - sprop-interleaving-depth 
         - sprop-prebuf-size 
         - sprop-prebuf-time 
         - sprop-scalability-information 
         - sprop-layer-range 
         - sprop-spatial-resoltuion 

      Declaring how Offer/Answer negotiation shall be performed: 

         - parameter-add 

   Furthermore, the following considerations are necessary: 

   o  Parameters used for declaring receiver capabilities are in general 
      downgradable; i.e., they express the upper limit for a sender's 
      possible behavior.  Thus a sender MAY select to set its encoder 
      using only lower/lesser or equal values of these parameters. 
      "sprop-parameter-sets" MUST NOT be used in a sender's declaration 
      of its capabilities, as the limits of the values that are carried 
      inside the parameter sets are implicit with the profile and level 
      used. 

   o  Parameters declaring a configuration point are not downgradable, 
      with the exception of the level part of the "profile-level-id" 
      parameter.  This expresses values a receiver expects to be used 
      and must be used verbatim on the sender side. 




 
 
Wenger, et al          Expires December 3, 2008               [Page 62] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   o  When a sender's capabilities are declared, and non-downgradable 
      parameters are used in this declaration, then these parameters 
      express a configuration that is acceptable.  In order to achieve 
      high interoperability levels, it is often advisable to offer 
      multiple alternative configurations; e.g., for the packetization 
      mode.  It is impossible to offer multiple configurations in a 
      single payload type.  Thus, when multiple configuration offers are 
      made, each offer requires its own RTP payload type associated with 
      the offer. 

   o  A receiver SHOULD understand all MIME parameters, even if it only 
      supports a subset of the payload format's functionality.  This 
      ensures that a receiver is capable of understanding when an offer 
      to receive media can be downgraded to what is supported by 
      receiver of the offer. 

   o  An answerer MAY extend the offer with additional media format 
      configurations.  However, to enable their usage, in most cases a 
      second offer is required from the offerer to provide the stream 
      properties parameters that the media sender will use.  This also 
      has the effect that the offerer has to be able to receive this 
      media format configuration, not only to send it. 

   o  If an offerer wishes to have non-symmetric capabilities between 
      sending and receiving, the offerer has to offer different RTP 
      sessions; i.e., different media lines declared as "recvonly" and 
      "sendonly", respectively.  This may have further implications on 
      the system. 

9.2.3. Usage with Session Multiplexing 

   If Session multiplexing is used, the rules on signaling media 
   decoding dependency in SDP as defined in [I-D.ietf-mmusic-decoding-
   dependency] apply. 

9.2.4. Usage in Declarative Session Descriptions 

   When H.264 or SVC over RTP is offered with SDP in a declarative 
   style, as in RTSP [RFC2326] or SAP [RFC2974], the following 
   considerations are necessary. 

   o  All parameters capable of indicating the properties of both a NAL 
      unit stream and a receiver are used to indicate the properties of 
      a NAL unit stream.  For example, in this case, the parameter 
      "profile-level-id" declares the values used by the stream, instead 
      of the capabilities of the sender.  This results in that the 
      following interpretation of the parameters MUST be used: 
 
 
Wenger, et al          Expires December 3, 2008               [Page 63] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      Declaring actual configuration or properties: 

         - profile-level-id 
         - sprop-parameter-sets 
         - packetization-mode 
         - sprop-interleaving-depth 
         - sprop-deint-buf-req 
         - sprop-max-don-diff 
         - sprop-init-buf-time 
         - sprop-prebuf-size 
         - sprop-prebuf-time 
         - sprop-layer-range 
         - sprop-spatial-resolution 
         - sprop-scalability-info 

      Not usable: 

         - max-mbps 
         - max-fs 
         - max-cpb 
         - max-dpb 
         - max-br 
         - redundant-pic-cap 
         - max-rcmd-nalu-size 
         - parameter-add 
         - deint-buf-cap 
         - scalable_layer_id 

   o  A receiver of the SDP is required to support all parameters and 
      values of the parameters provided; otherwise, the receiver MUST 
      reject (RTSP) or not participate in (SAP) the session.  It falls 
      on the creator of the session to use values that are expected to 
      be supported by the receiving application. 

9.3. Examples 

9.3.1. Example for Offering A Single SVC Session 

      Offerer -> Answerer SDP message: 

      m = video 20000 RTP/AVP 96 97 98 
      a = rtpmap:96 H264/90000 
      a = fmtp:96 profile-level-id=4d400a; packetization-mode=1; \ 
        sprop-parameter-sets=Z01ACprLFicg,aP4Eag= =; 
      a = rtpmap:97 H264-SVC/90000 
      a = fmtp:97 profile-level-id=53000c; packetization-mode=1; \ 
        sprop-parameter-sets=Z01ACprLFicg,Z1MADEsA1NZYWCWQ,aP4Eag==, \ 
 
 
Wenger, et al          Expires December 3, 2008               [Page 64] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

        aEvgRqA=,aGvgRiA=; 
      a = rtpmap:98 H264-SVC/90000 
      a = fmtp:98 profile-level-id=53000c; packetization-mode=2; \ 
        init-buf-time=156320; sprop-parameter-sets=Z01ACprLFicg, \ 
        Z1MADEsA1NZYWCWQ,aP4Eag= =,aEvgRqA=,aGvgRiA=; 

9.3.2. Example for Offering Session Multiplexing 

      Offerer -> Answerer SDP message: 

      a = group:DDP 1 2 3 

      m = video 20000 RTP/AVP 96 97 98 
      a = rtpmap:96 H264/90000 
      a = fmtp:96 profile-level-id=4d400a; packetization-mode=0; \ 
        sprop-parameter-sets=Z01ACprLFicg,aP4Eag==; 
      a = rtpmap:97 H264/90000 
      a = fmtp:97 profile-level-id=53000c; packetization-mode=1; \ 
        sprop-parameter-sets=Z01ACprLFicg, \ 
        Z1MADEsA1NZYWCWQ,aP4Eag= =,aEvgRqA=,aGvgRiA=; 
      a = rtpmap:98 H264-SVC/90000 
      a = fmtp:98 profile-level-id=53000c; packetization-mode=2; \ 
        init-buf-time=156320; sprop-parameter-sets=Z01ACprLFicg, \ 
        Z1MADEsA1NZYWCWQ,aP4Eag= =,aEvgRqA=,aGvgRiA=; 
      a = mid:1 

      m = video 20002 RTP/AVP 99 
      a = rtpmap:99 H264-SVC/90000 
      a = fmtp:99 profile-level-id=53000c; packetization-mode=1; \ 
        sprop-parameter-sets=Z01ACprLFicg, \ 
        Z1MADEsA1NZYWCWQ,aP4Eag= =,aEvgRqA=,aGvgRiA=; 
      a = mid:2 
      a = depend:99 lay 1:97,98; 

      m = video 20004 RTP/AVP 100 
      a = rtpmap:100 H264-SVC/90000 
      a = fmtp:100 profile-level-id=53000c; packetization-mode=1; \ 
        sprop-parameter-sets=Z01ACprLFicg, \ 
        Z1MADEsA1NZYWCWQ,aP4Eag= =,aEvgRqA=,aGvgRiA=; 
      a = mid:3 
      a = depend:100 lay 1:97,98 2:99; 

9.4. Parameter Set Considerations 

   Please see section 8.4 of [RFC3984]. 


 
 
Wenger, et al          Expires December 3, 2008               [Page 65] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

10. Security Considerations 

   Section 9 of [RFC3984] applies.  Additionally, the following applies. 

   Decoders MUST exercise caution with respect to the handling of 
   reserved NAL unit types and reserved SEI messages, particularly if 
   they contain active elements, and MUST restrict their domain of 
   applicability to the presentation containing the stream.  The safest 
   way is to simply discard these NAL units and SEI messages. 

   When integrity protection is applied, care MUST be taken that the 
   stream being transported may be scalable; hence a receiver may be 
   able to access only part of the entire stream. 

      Informative note: Other security aspects, including 
      confidentiality, authentication, and denial-of-service threat, 
      for SVC are similar as H.264/AVC, as discussed in section 9 of 
      [RFC3984]. 

11. Congestion Control 

   Within any given RTP session carrying payload according to this 
   specification, the provisions of section 12 of [RFC3984] apply.  
   Reducing the session bandwidth is possible by one or more of the 
   following means, listed in an order that, in most cases, will assure 
   the least negative impact to the user experience: 

   a) within the highest Layer identified by the DID field, utilize the 
     TID and/or QID fields in the NAL unit header to drop NAL units 
     with lower importance for the decoding process or human 
     perception. 

   b) drop all NAL units belonging to the highest enhancement Layer as 
     identified by the highest DID value. 

   c) dropping NAL units according to their importance for the decoding 
     process, as indicated by the fields in the NAL unit header of the 
     NAL units or in the prefix NAL units. 

   d) dropping NAL units or entire packets not according to the 
     aforementioned rules (media-unaware stream thinning).  This 
     results in the reception of a non-compliant bitstream and, most 
     likely, in very annoying artifacts 

      Informative note: The discussion above is centered on NAL units 
      and not on packets, primarily because that is the level where 
      senders can meaningfully manipulate the scalable bitstream.  The 
 
 
Wenger, et al          Expires December 3, 2008               [Page 66] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

      mapping of NAL units to RTP packets is fairly flexible when using 
      aggregation packets.  Depending on the nature of the congestion 
      control algorithm, the "dimension" of congestion measurement 
      (packet count or bitrate) and reaction to it (reducing packet 
      count or bitrate or both) can be adjusted accordingly. 

   All aforementioned means are available to the RTP sender, regardless 
   whether that sender is located in the sending endpoint or in a mixer 
   based MANE. 

   When a translator-based MANE is employed, then the MANE MAY 
   manipulate the session only on the MANE's outgoing path, so that the 
   sensed end-to-end congestion falls within the permissible envelope.  
   As all translators, in this case the MANE needs to rewrite RTCP RRs 
   to reflect the manipulations it has performed on the session. 

      Informative note: Applications MAY also implement, in addition or 
      separately, other congestion control mechanisms, e.g. as 
      described in [RFC3450] and [Yan]. 

12. IANA Consideration 

   [Edt. Note: A new media type should be registered from IANA.] 

13. Informative Appendix: Application Examples 

13.1. Introduction 

   Scalable video coding is a concept that has been around at least 
   since MPEG-2 [MPEG2], which goes back as early as 1993.  
   Nevertheless, it has never gained wide acceptance; perhaps partly 
   because applications didn't materialize in the form envisioned during 
   standardization. 

   ISO/IEC MPEG and ITU-T VCEG, respectively, performed a requirement 
   analysis for the SVC project.  Dozens of scenarios have been studied.  
   While some of the scenarios appear not to follow the most basic 
   design principles of the Internet, e.g. as discussed in section 13.5. 
   , -- and are therefore not appropriate for IETF standardization -- 
   others are clearly in the scope of IETF work.  Of these, this draft 
   chooses the following subset for immediate consideration.  The MPEG 
   and VCEG requirement documents are available in [JVT-N026] and [JVT-
   N027], respectively. 

   With these remarks, we now introduce three main application scenarios 
   that we consider as relevant, and that are implementable with this 
   specification. 
 
 
Wenger, et al          Expires December 3, 2008               [Page 67] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

13.2. Layered Multicast 

   This well-understood form of the use of layered coding [McCanne] 
   implies that all layers are individually conveyed in their own RTP 
   packet streams, each carried in its own RTP session using the IP 
   (multicast) address and port number as the single demultiplexing 
   point.  Receivers "tune" into the layers by subscribing to the IP 
   multicast, normally by using IGMP [IGMP].  Depending on the 
   application scenario, it is also possible to convey a number of 
   layers in one RTP session, when finer operation points within the 
   subset of layers are not needed. 

   Layered multicast has the great advantage of simplicity and easy 
   implementation.  However, it has also the great disadvantage of 
   utilizing many different transport addresses.  While we consider this 
   not to be a major problem for a professionally maintained content 
   server, receiving client endpoints need to open many ports to IP 
   multicast addresses in their firewalls.  This is a practical problem 
   from a firewall and network address translation (NAT) viewpoint.  
   Furthermore, even today IP multicast is not as widely deployed as 
   many wish. 

   We consider layered multicast an important application scenario for 
   the following reasons.  First, it is well understood and the 
   implementation constraints are well known.  Second, there may well be 
   large scale IP networks outside the immediate Internet context that 
   may wish to employ layered multicast in the future.  One possible 
   example could be a combination of content creation and core-network 
   distribution for the various mobile TV services, e.g. those being 
   developed by 3GPP (MBMS) [MBMS] and DVB (DVB-H) [DVB-H]. 

13.3. Streaming of an SVC Scalable Stream 

   In this scenario, a streaming server has a repository of stored SVC 
   coded layers for a given content.  At the time of streaming, and 
   according to the capabilities, connectivity, and congestion situation 
   of the client(s), the streaming server generates and serves a 
   scalable stream.  Both unicast and multicast serving is possible.  At 
   the same time, the streaming server may use the same repository of 
   stored layers to compose different streams (with a different set of 
   layers) intended for other audiences. 

   As every endpoint receives only a single SVC RTP session, the number 
   of firewall pinholes can be optimized to one. 

   The main difference between this scenario and straightforward 
   simulcasting lies in the architecture and the requirements of the 
 
 
Wenger, et al          Expires December 3, 2008               [Page 68] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   streaming server, and is therefore out of the scope of IETF 
   standardization.  However, compelling arguments can be made why such 
   a streaming server design makes sense.  One possible argument is 
   related to storage space and channel bandwidth.  Another is bandwidth 
   adaptability without transcoding -- a considerable advantage in a 
   congestion controlled network.  When the streaming server learns 
   about congestion, it can reduce sending bitrate by choosing fewer 
   layers, when composing the layered stream; see section 11. .  SVC is 
   designed to gracefully support both bandwidth rampdown and bandwidth 
   rampup with a considerable dynamic range.  This payload format is 
   designed to allow for bandwidth flexibility in the mentioned sense.  
   While, in theory, a transcoding step could achieve a similar dynamic 
   range, the computational demands are impractically high and video 
   quality is typically lowered -- therefore, few (if any) streaming 
   servers implement full transcoding. 

13.4. Multicast to MANE, SVC Scalable Stream to Endpoint 

   This scenario is a bit more complex, and designed to optimize the 
   network traffic in a core network, while still requiring only a 
   single pinhole in the endpoint's firewall.  One of its key 
   applications is the mobile TV market. 

   Consider a large private IP network, e.g. the core network of 3GPP.  
   Streaming servers within this core network can be assumed to be 
   professionally maintained.  We assume that these servers can have 
   many ports open to the network and that layered multicast is a real 
   option.  Therefore, we assume that the streaming server multicasts 
   SVC scalable layers, instead of simulcasting different 
   representations of the same content at different bit rates. 

   Also consider many endpoints of different classes.  Some of these 
   endpoints may not have the processing power or the display size to 
   meaningfully decode all layers; others may have these capabilities.  
   Users of some endpoints may not wish to pay for high quality and are 
   happy with a base service, which may be cheaper or even free.  Other 
   users are willing to pay for high quality.  Finally, some connected 
   users may have a bandwidth problem in that they can't receive the 
   bandwidth they would want to receive -- be it through congestion, 
   connectivity, change of service quality, or for whatever other 
   reasons.  However, all these users have in common that they don't 
   want to be exposed too much, and therefore the number of firewall 
   pinholes need to be small. 

   This situation can be handled best by introducing middleboxes close 
   to the edge of the core network, which receive the layered multicast 
   streams and compose the single SVC scalable bit stream according to 
 
 
Wenger, et al          Expires December 3, 2008               [Page 69] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   the needs of the endpoint connected.  These middleboxes are called 
   MANEs throughout this specification.  In practice, we envision the 
   MANE to be part of (or at least physically and topologically close 
   to) the base station of a mobile network, where all the signaling and 
   media traffic necessarily are multiplexed on the same physical link.  
   This is why we do not worry too much about decomposition aspects of 
   the MANE as such. 

   MANEs necessarily need to be fairly complex devices.  They certainly 
   need to understand the signaling, so, for example, to associate the 
   PT octet in the RTP header with the SVC payload type.   

   A MANE may aggregate multiple RTP streams, possibly from multiple RTP 
   sessions, thus to reduce the number of firewall pinholes required at 
   the endpoints. This type of MANEs is conceptually easy to implement 
   and can offer powerful features, primarily because it necessarily can 
   "see" the payload (including the RTP payload headers), utilize the 
   wealth of layering information available therein, and manipulate it. 

   While such an MANE operation in its most trivial form (combining 
   multiple RTP packet streams into a single one) can be implemented 
   comparatively simply -- reordering the incoming packets according to 
   the DON and sending them in the appropriate order -- more complex 
   forms can also be envisioned.  For example, a MANE can be optimizing 
   the outgoing RTP stream to the MTU size of the outgoing path by 
   utilizing the aggregation and fragmentation mechanisms of this memo. 

   A MANE can also perform stream thinning, so to adhere to congestion 
   control principles as discussed in section 11. .  While the 
   implementation of the forward (media) channel of such a MANE appears 
   to be comparatively simple, the need to rewrite RTCP RRs makes even 
   such a MANE a complex device. 

   While the implementation complexity of either case of a MANE, as 
   discussed above, is fairly high, the computational demands are 
   comparatively low.  In particular, SVC and/or this specification 
   contain means to easily generate the correct inter-layer decoding 
   order of NAL units.  No serious bit-oriented processing is required 
   and no significant state information (beyond that of the signaling 
   and perhaps the SVC sequence parameter sets) need to be kept.  

13.5. Scenarios Currently Not Considered 

   Remarks have been made that the current draft does not take into 
   consideration at least one application scenario which some JVT folks 
   considered important.  In particular, their idea was to make the RTP 
   payload format (or the media stream itself) self-contained enough 
 
 
Wenger, et al          Expires December 3, 2008               [Page 70] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   that a stateless, non-signaling-aware device can "thin" an RTP 
   session to meet the bandwidth demands of the endpoint.  They called 
   this device a "Router" or "Gateway", and sometimes a MANE.  
   Obviously, it's not a Router or Gateway in the IETF sense.  To 
   distinguish it from a MANE as defined in RFC 3984 and in this 
   specification, let's call it an MDfH (Magic Device from Heaven). 

   To simplify discussions, let's assume point-to-point traffic only.  
   The endpoint has a signaling relationship with the streaming server, 
   but it is known that the MDfH is somewhere in the media path (e.g. 
   because the physical network topology ensures this).  It has been 
   requested, at least implicitly through MPEG's and JVT's requirements 
   document, that the MDfH should be capable to intercept the SVC 
   scalable bit stream, modify it by dropping packets or parts thereof, 
   and forwarding the resulting packet stream to the receiving endpoint.  
   It has been requested that this payload specification contains 
   protocol elements facilitating such an operation, and the argument 
   has been made that the NRI field of RFC 3984 serves exactly the same 
   purpose. 

   The authors of this I-D do not consider the scenario above to be 
   aligned with the most basic design philosophies the IETF follows, and 
   therefore have not addressed the comments made (except through this 
   section).  In particular, we see the following problems with the MDfH 
   approach): 

   o As the very minimum, the MDfH would need to know which RTP streams 
     are carrying SVC.  We don't see how this could be accomplished but 
     by using a static payload type.  None of the IETF defined RTP 
     profiles envision static payload types for SVC, and even the de-
     facto profiles developed by some application standard 
     organizations (3GPP for example) do not use this outdated concept.  
     Therefore, the MDfH necessarily needs to be at least "listening" 
     to the signaling. 

   o If the RTP packet payload were encrypted, it would be impossible 
     to interpret the payload header and/or the first bytes of the 
     media stream.  We understand that there are crypto schemes under 
     discussion that encrypt only the last n bytes of an RTP payload, 
     but we are more than unsure that this is fully in line with the 
     IETF's security vision. 

   Even if the above two problems would have been overcome through 
   standardization outside of the IETF, we still foresee serious design 
   flaws: 


 
 
Wenger, et al          Expires December 3, 2008               [Page 71] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   o An MDfH can't simply dump RTP packets it doesn't want to forward.  
     It either needs to act as a full RTP Translator (implying that it 
     rewrites RTCP RRs and such), or it needs to patch the RTP sequence 
     numbers to fulfill the RTP specification.  Not doing either would, 
     for the receiver, look like the gaps in the sequence numbers 
     occurred due to unintentional erasures, which has interesting 
     effects on congestion control (if implemented), will break pretty 
     much every meta-payload ever developed, and so on.  (Many more 
     points could be made here). 

   In summary, based on our current knowledge we are not willing to 
   specify protocol mechanisms that support an operation point that has 
   so little in common with classic RTP use. 

13.6. SSRC Multiplexing 

   The authors have played with the idea of introducing SSRC 
   multiplexing, i.e. allowing sending multiple RTP packet streams 
   containing layers in the same RTP session, differentiated by SSRC 
   values.  Our intention was to minimize the number of firewall 
   pinholes in an endpoint to one, by using MANEs to aggregate multiple 
   outgoing sessions stemming from a server into a single session (with 
   SSRC multiplexed packet streams).  We were hoping that would be 
   feasible even with encrypted packets in an SRTP context. 

   While an implementation along these lines indeed appears to be 
   feasible for the forward media path, the RTCP RR rewrite cannot be 
   implemented in the way necessary for this scheme to work.  This 
   relates to the need to authenticate the RTCP RRs as per SRTP 
   [RFC3711].  While the RTCP RR itself does not need to be rewritten by 
   the scheme we envisioned, its transport addresses needs to be 
   manipulated.  This, in turn, is incompatible with the mandatory 
   authentication of RTCP RRs.  As a result, there would be a 
   requirement that a MANE needs to be in the RTCP security context of 
   the sessions, which was not envisioned in our use case. 

   As the envisioned use case cannot be implemented, we refrained to add 
   the considerable document complexity to support SSRC multiplexing 
   herein. 

14. References 

14.1. Normative References 

   [H.264]   ITU-T Recommendation H.264, "Advanced video coding for 
             generic audiovisual services", Version 4, July 2005. 

 
 
Wenger, et al          Expires December 3, 2008               [Page 72] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   [I-D.ietf-mmusic-decoding-dependency]  Schierl, T., and Wenger, S., 
             "Signaling media decoding dependency in Session Description 
             Protocol (SDP)", draft-ietf-mmusic-decoding-dependency-02 
             (work in progress), May 2008. 

   [MPEG4-10] ISO/IEC International Standard 14496-10:2005. 

   [RFC2119] Bradner, S., "Key words for use in RFCs to Indicate 
             Requirement Levels", BCP 14, RFC 2119, March 1997. 

   [RFC3264] Rosenberg, J. and H. Schulzrinne, "An Offer/Answer Model 
             With Session Description Protocol (SDP)", RFC 3264, June 
             2002. 

   [RFC3548] Josefsson, S., "The Base16, Base32, and Base64 Data 
             Encodings", RFC 3548, July 2003.  

   [RFC3550] Schulzrinne, H., Casner, S., Frederick, R., and Jacobson, 
             V., "RTP: A Transport Protocol for Real-Time Applications", 
             STD 64, RFC 3550, July 2003. 

   [RFC3984] Wenger, S., Hannuksela, M., Stockhammer, T., Westerlund,M., 
             and Singer, D., "RTP Payload Format for H.264 Video", RFC 
             3984, February 2005. 

   [RFC4566] Handley, M., Jacobson, V., and Perkins, C., "SDP: Session 
             Description Protocol", RFC 4566, July 2006. 

   [SVC]     Joint Video Team, "Joint Draft 11 of SVC Amendment", 
             available from http://ftp3.itu.ch/av-arch/jvt-
             site/2007_06_Geneva/JVT-X201.zip, Geneva, Switzerland, June 
             2007. 

14.2. Informative References 

   [DVB-H]   DVB - Digital Video Broadcasting (DVB); DVB-H 
             Implementation Guidelines, ETSI TR 102 377, 2005. 

   [H.241]   ITU-T Rec. H.241, "Extended video procedures and control 
             signals for H.300-series terminals", May 2006. 

   [IGMP]    Cain, B., Deering S., Kovenlas, I., Fenner, B., and 
             Thyagarajan, A., "Internet Group Management Protocol, 
             Version 3", RFC 3376, October 2002. 



 
 
Wenger, et al          Expires December 3, 2008               [Page 73] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   [JVT-N026] Ohm J.-R., Koenen, R., and Chiariglione, L. (ed.), "SVC 
             requirements specified by MPEG (ISO/IEC JTC1 SC29 WG11)", 
             JVT-N026, available from http://ftp3.itu.ch/av-arch/jvt-
             site/2005_01_HongKongGeneva/JVT-N026.doc, Hong Kong, China, 
             January 2005. 

   [JVT-N027] Sullivan, G., and Wiegand, T. (ed.), "SVC requirements 
             specified by VCEG (ITU-T SG16 Q.6)", JVT-N027, available 
             from http://ftp3.itu.ch/av-arch/jvt-
             site/2005_01_HongKongGeneva/JVT-N027.doc, Hong Kong, China, 
             January 2005. 

   [McCanne] McCanne, S., Jacobson, V., and Vetterli, M., "Receiver-
             driven layered multicast", in Proc. of ACM SIGCOMM'96, 
             pages 117--130, Stanford, CA, August 1996. 

   [MBMS]    3GPP - Technical Specification Group Services and System 
             Aspects; Multimedia Broadcast/Multicast Service (MBMS); 
             Protocols and codecs (Release 6), December 2005. 

   [MPEG2]   ISO/IEC International Standard 13818-2:1993. 

   [RFC2326] Schulzrinne, H., Rao, A., and R. Lanphier, "Real Time 
             Streaming Protocol (RTSP)", RFC 2326, April 1998. 

   [RFC2974] Handley, M., Perkins, C., and E. Whelan, "Session 
             Announcement Protocol", RFC 2974, October 2000. 

   [RFC3450] Luby, M., Gemmell, J., Vicisano, L., Rizzo, L., and 
             Crowcroft, J., "Asynchronous layered coding (ALC) protocol 
             instantiation", RFC 3450, December 2002. 

   [RFC3711] Baugher, M., McGrew, D, Naslund, M., Carrara, E., and 
             Norrman, K., "The secure real-time transport protocol 
             (SRTP)", RFC 3711, March 2004. 

   [Yan]     Yan, J., Katrinis, K., May, M., and Plattner, R., "Media-
             And TCP-friendly congestion control for scalable video 
             streams", in IEEE Trans. Multimedia, pages 196--206, April 
             2006. 

15. Authors' Addresses 

   Stephan Wenger 
   Nokia 
   955 Page Mill Road 
 
 
Wenger, et al          Expires December 3, 2008               [Page 74] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   Palo Alto, CA 94304 
   USA 
       
   Phone: +1-650-862-7368 
   EMail: stewe@stewe.org 
    
   Ye-Kui Wang 
   Nokia Research Center 
   P.O. Box 100 
   33721 Tampere 
   Finland 
       
   Phone: +358-50-466-7004 
   EMail: ye-kui.wang@nokia.com 
    
   Thomas Schierl 
   Fraunhofer HHI 
   Einsteinufer 37 
   D-10587 Berlin 
   Germany 
       
   Phone: +49-30-31002-227 
   Email: schierl@hhi.fhg.de 
    
   Alex Eleftheriadis 
   Vidyo, Inc. 
   433 Hackensack Ave. 
   Hackensack, NJ 07601 
   USA 
       
   Phone: +1-201-467-5135 
   Email: alex@vidyo.com 
    

Intellectual Property Statement 

   The IETF takes no position regarding the validity or scope of any 
   Intellectual Property Rights or other rights that might be claimed to 
   pertain to the implementation or use of the technology described in 
   this document or the extent to which any license under such rights 
   might or might not be available; nor does it represent that it has 
   made any independent effort to identify any such rights.  Information 
 
 
Wenger, et al          Expires December 3, 2008               [Page 75] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   on the procedures with respect to rights in RFC documents can be 
   found in BCP 78 and BCP 79. 

   Copies of IPR disclosures made to the IETF Secretariat and any 
   assurances of licenses to be made available, or the result of an 
   attempt made to obtain a general license or permission for the use of 
   such proprietary rights by implementers or users of this 
   specification can be obtained from the IETF on-line IPR repository at 
   http://www.ietf.org/ipr. 

   The IETF invites any interested party to bring to its attention any 
   copyrights, patents or patent applications, or other proprietary 
   rights that may cover technology that may be required to implement 
   this standard.  Please address the information to the IETF at 
   ietf-ipr@ietf.org. 

Disclaimer of Validity 

   This document and the information contained herein are provided on an 
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS 
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND 
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS 
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF 
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED 
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. 

Copyright Statement 

   Copyright (C) The IETF Trust (2008). 

   This document is subject to the rights, licenses and restrictions 
   contained in BCP 78, and except as set forth therein, the authors 
   retain all their rights. 

Acknowledgement 

   Funding for the RFC Editor function is currently provided by the 
   Internet Society.  Further, the author Thomas Schierl of Fraunhofer 
   HHI is sponsored by the European Commission under the contract number 
   FP7-ICT-214063, project SEA.  The authors want to thank Jonathan 
   Lennox for his valuable comments on and input to the draft. 

16. Open Issues 

   1) There is a list of remaining issues for decoding order recovery in 
     session multiplexing, as documented in editing notes. 

 
 
Wenger, et al          Expires December 3, 2008               [Page 76] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   2) A lot of work needed for section9.2 (SDP parameters). 

   3) Bugs in RFC 3984 (see the BIS draft) need to be fixed also in the 
     memo. 

   4) Clarify the usage of the new parameters like sprop-scalability-
     info, relation to SEI and usage in offer/answer.  In the Design 
     Team's conference call on 6 May 2008, it was decided that Ye-Kui 
     would study and report. 

   5) Non-VCL NAL units, e.g. SEI messages and parameter sets, may be 
     needed by an enhancement layer but not the base layer. However, 
     according to SVC, within an access unit, these non-VCL NAL units 
     must precede VCL NAL units in decoding order. In session 
     multiplexing, should non-VCL NAL units be transported in the same 
     session as the layer that requires the non-VCL NAL unit, or should 
     they be always transported in the base session? It may be 
     impossible to find out without parsing details which session 
     respectively SPS/subset SPS a picture parameter set belongs to. It 
     may make sense for simplicity to allow a MANE to include all of 
     the non-VCL NAL units within all the sessions.  In the Design 
     Team's conference call on 6 May 2008, it was decided that 
     Jonathan/Alex would provide text change for review, including 
     handling of prefix NAL units. 

   6) sprop-spatial-resolution: do we need this for offering/answering 
     spatial scalable layers? In this draft or a more generic draft? In 
     the Design Team's conference call on 6 May 2008, it was decided 
     that Ye-Kui will study and report. 

17. Changes Log 

   From draft-ietf-avt-rtp-svc-08 to draft-ietf-avt-rtp-svc-09 

   5-9 May 2008: YkW 
    
   - Added Alex as an editor. Welcome! 
   -  Added text for session-multiplexing packetization modes 
   -  Updated section6.5 (Packetization Modes) and added section6.5.1 
   -  Updated section6.6 (DON) and added section6.6.1 
   -  Updated PACSI introductory text and semantics (section6.9) 
   -  Updated packetization rules for session multiplexing (section7.1) 
   -  Updated the de-packetization process for session multiplexing 
     (section8.1) 

 
 
Wenger, et al          Expires December 3, 2008               [Page 77] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   -  Updated semantics of existing media type parameters and added new 
     media type parameters ("session-multiplexing-packetization-mode", 
     "sprop-session-multiplexing-depth", "sprop-desemul-buf-req", 
     "desemul-buf-cap", "sprop-desemul-init-buf-time", "sprop-semul-
     max-don-diff") in section9.1. 
   -  Removed obsolete comments. 
   -  Updated some definitions. 
   -  Updated one design principle regarding cases that must use RFC 
     3984 encapsulation.   
   -  Removed "(Informative)" from the title of section8 (De-
     Packetization Process) - same to be proposed to RFC 3984 bis. 
   -  Updated the open issues 
   -  Removed earlier changes log that can be found from earlier 
     versions of the draft 
    
   13 May 2008: AE 
    
   -  Corrected definition of "highest RTP session" in "enhancement RTP 
     session" definition. 
   -  Moved the triggering of the use of the S and E bits from the X 
     flag to the Y flag, so that they are triggered together with 
     TL0PICIDX.  
   -  Other minor editorial corrections for language.  
    
   13 May 2008: YkW 
    
   -  Removed some obsolete comments. 
    
   14 May 2008: AE 
    
   -  Moved definition of lower/higher/lowest/highest RTP session from 
     definitions (part of "enhancement RTP session") to 8.1.1, right 
     before they are first needed. The text assumes that base is 
     lowest, and highest is the single RTP session which no other 
     session depends on.  
   -  Modified definition of "operation point" to distinguish between 
     the OP and the associated bitstream, as there may be multiple ways 
     to construct it (i.e., removing or not removing unneeded NAL units 
     below the operation point).  



 
 
Wenger, et al          Expires December 3, 2008               [Page 78] 

Internet-Draft     RTP Payload Format for SVC Video           June 2008 
    

   -  Renamed modes as follows: NITS->NI-T, NICD->NI-C, NICB->NI-TC, and 
     AINT->I-C. This way the interleaving and DON process are evident 
     from the acronym.  
   -  Rephrased "target NAL unit" definition (in Section 6.9) to be a 
     bit more clear. 
    
   15 May 2008: YkW 
    
   -  Added a comment regarding the definition of operation point. 
   -  Updated open issues (removed the one on PACSI). 
   -  Changed the Word template used to generation of this I-D. 
    
    
   From draft-ietf-avt-rtp-svc-09 to draft-ietf-avt-rtp-svc-10 

   30 May 2008: TS 
    
   - Improved text in 7.1 for NI-T 
    
   02 June 2008: TS 
    
   - Improved text on NI-T and NI-TC in section 8.1.1 
   - Added new packet type NI-MTAP in section 6.10  
   - Added informative text on placeholder NAL units to section 7.1.1 
   - Added text on placeholder NAL units to 8.1.1 
   - Changed text regarding the order of RTP packets are delivered from 
     the RFC3550 process to the re-ordering process in section 8.   
    
   02 June 2008: JL 
    
   - Added non-VCL and prefix NAL packetization rules sent by Jonathan 
     Lennox in sections 7.1.4 and 7.1.5. 
   - Added informative reordering algorithm. 
    








 
 
Wenger, et al          Expires December 3, 2008               [Page 79] 

